Repository: 6555355/Scan_yan1
Catalog: PrinterStubC/Resource/ResString.*-*.resx
Languages: chs, cht, th

# JobListColumnHeader_Size
source: Size
chs: 大小
cht: 大小
th: ขนาด

# SoftwareProductName
source: Printer Manager
chs: 打印管理中心
cht: 列印管理中心
th: ผู้จัดการเครื่องพิมพ์

# SoftwareProductName2
source: Printer Center
chs: 打印管理中心
cht: 列印管理中心
th: ศูนย์กลางเครื่องพิมพ์

# UpdaterError_VersionNoMatch
source: Version mismatch between firmware and hardware.
chs: 固件和硬件版本不匹配。.
cht: 固件和硬體版本不匹配。.
th: รุ่นไม่ตรงกันระหว่างเครื่องมือและชุดคำสั่ง.

# ColorEnum_Cyan
source: Cyan
chs: 青
cht: 青
th: สีฟ้า

# UIViewMode_TopDown
source: Normal
chs: 普通
cht: 普通
th: ปกติ

# ColorEnum_Orange
source: Orange
chs: 橙
cht: 橙
th: สีส้ม

# UISuccess_LoadSetFromBoardSuccess
source: Load printer settings successfully!
chs: 加载打印机设置成功!
cht: 載入印表機設置成功!
th: การอ่านค่าเครื่องพิมพ์ที่ตั้งเอาไว้ประสบความสำเร็จ!

# CalibrationDescription_Calibration
source: Fill the value as the calibration.
chs: 按照校准数据填入校准值.
cht: 按照校準資料填入校準值.
th: เติมค่าที่เสมือนการคำนวณเข้าไป.

# UIError_UpdateFail
source: Updating failed!
chs: 升级失败!
cht: 升級失敗!
th: การปรับปรุงล้มเหลว!

# UIError_FileNotExist
source: Below files have been deleted.
chs: 以下的打印文件已被删除。.
cht: 以下的列印檔已被刪除。.
th: แฟ้มข้อมูลข้างล่างถูกลบทิ้งแล้ว.

# CalibrationSubStep_Left
source: Left Calibration
chs: 左校准
cht: 左校準
th: การคำนวณด้านซ้าย

# UIError_MeasureMediaWidthFailed
source: Measure media width failed.
chs: 测量纸宽失败。.
cht: 測量紙寬失敗。.
th: การวัดความกว้างวัสดุพิมพ์ล้มเหลว.

# JetStatusEnum_PrinterOffline
source: Printer Offline
chs: 打印机离线
cht: 印表機離線
th: เครื่องพิมพ์ไม่ได้เชื่อมต่อ

# JobStatus_Printed
source: Printed
chs: 打印完成
cht: 列印完成
th: พิมพ์เสร็จ

# JetStatusEnum_Error
source: Error
chs: 错误
cht: 錯誤
th: ข้อบกพร่อง

# SpeedEnum_LowSpeed
source: Low Speed
chs: 低速
cht: 低速
th: ความเร็วต่ำ

# SpeedEnum_CustomSpeed
source: OverClock Speed
chs: 超频
cht: 超频
th: อัตราเร็วโอเวอร์คล็อก

# buttonCancel_Text
source: &Cancel
chs: 取消(&C)
cht: 取消(&C)
th: ยกเลิก(&c)

# WhiteInkPrintMode_UnderBaseWholeImage
source: UnderBase Whole Image
chs: 图像铺底
cht: 圖像鋪底
th: ภาพทั้งหมดข้างใต้ฐาน

# WhiteInkPrintMode_MiddleWholeImage
source: Sandwich whole
chs: 白色居中
cht: 白色居中

# WhiteInkPrintMode_MiddleSpotColor
source: Sandwich spot color
chs: 专色居中
cht: 专色居中

# Confirm_Exit
source: Are you sure to exit?
chs: 您确认要退出吗?
cht: 您確認要退出嗎?
th: ท่านแน่ใจหรือว่าจะออกไป?

# DispName_PowerOnTotalTime
source: Power on total time
chs: 电源开启总时间
cht: 電源開啟總時間
th: เวลาทั้งหมดที่เปิดไฟฟ้า

# JobListColumnHeader_Name
source: Name
chs: 名字
cht: 名字
th: ชื่อ

# WhiteInkPrintMode_NotPrintWhiteInk
source: No white ink
chs: 不打印白墨
cht: 不列印白墨
th: ไม่มีน้ำหมึกสีขาว

# JetStatusEnum_Initializing
source: Initializing
chs: 初始化
cht: 初始化
th: การเตรียม

# JobStatus_Waiting
source: Waiting
chs: 等待打印
cht: 等待列印
th: กำลังรอ

# UpdatingProgress
source: Updating {0}%
chs: 升级中 {0}%
cht: 升級中 {0}%
th: } การปรับปรุง

# DisplayTime_MilliSecond
source: MilliSecond
chs: 毫秒
cht: 毫秒
th: เศษหนึ่งส่วนพันวินาที

# UILengthUnit_Centimeter
source: Centimeters
chs: 厘米
cht: 釐米
th: เซนติเมตร

# FileFilter_Env
source: Setting Files (*.xml)|*.xml
chs: 配置文件 (*.xml)|*.xml
cht: 配置檔 (*.xml)|*.xml
th: การตั้งแฟ้มข้อมูล (*.xml)|*.xml

# FileFilter_Plb
source: Layout Files (*.plb)|*.plb
chs: 布局文件 (*.plb)|*.plb
cht: 佈局文件 (*.plb)|*.plb

# UIError_LoadSetFromBoardFail
source: Load printer settings failed!
chs: 加载打印机设置失败!
cht: 載入印表機設置失敗!
th: การอ่านค่าเครื่องพิมพ์ที่ตั้งเอาไว้ล้มเหลว!

# Confirm_Delete
source: Are you sure to delete?
chs: 您确认要删除吗?
cht: 您確認要刪除嗎?
th: ท่านแน่ใจหรือว่าจะลบทิ้ง?

# JetStatusEnum_Pause
source: Paused
chs: 暂停
cht: 暫停
th: หยุดชั่วคราว

# JobListColumnHeader_Status
source: Status
chs: 状态
cht: 狀態
th: สถานะ

# CalibrationSubStep_Vertical
source: Vertical Calibration
chs: 垂直对齐校准
cht: 垂直對齊校準
th: การคำนวณแนวดิ่ง

# CalibrationSubStep_Overlap
source: Overlap Calibration
chs: 重叠校准
cht: 重疊校準

# BoardEnum_PeriphBoard
source: Peripheral Board
chs: 外设板
cht: 外設板
th: แผงวงจรอุปกรณ์ต่อพ่วง

# JobListColumnHeader_PrintedDate
source: Printed Date
chs: 打印日期
cht: 列印日期
th: วันที่ที่พิมพ์

# Suffix_UILengthUnit_Meter
source: m
chs: 米
cht: 米
th: เมตร

# WhiteInkPrintMode_OverCoatWholeImage
source: OverCoat Whole Image
chs: 图像盖顶
cht: 圖像蓋頂
th: เคลือบเหนือภาพทั้งหมด

# SpeedEnum_HighSpeed
source: High Speed
chs: 高速
cht: 高速
th: อัตราเร็วสูง

# CalibrationTitle_Finish
source: Finished
chs: 完成
cht: 完成
th: เสร็จสิ้น

# CaliWizard_Cancel
source: Are you sure to exit the calibarion wizard?
chs: 您确认要退出校准向导吗?
cht: 您確認要退出校準嚮導嗎?
th: ท่านแน่ใจหรือว่าจะออกจากวิธีคำนวณสำเร็จรูป?

# ButtonFinish
source: &Finish
chs: 结束(&F)
cht: 結束(&F)
th: เสร็จสิ้น(&f)

# FileFilter_Txt
source: Text Files (*.txt)|*.txt
chs: 文本文档 (*.txt)|*.txt
cht: 文本文檔 (*.txt)|*.txt
th: แฟ้มข้อมูลตัวอักษร (*.txt)|*.txt

# UIError_SaveRealTimeFail
source: Set realtime setting error!
chs: 设置实时参数失败!
cht: 設置即時參數失敗!
th: ตั้งข้อบกพร่องการตั้งเวลาจริง!

# WhiteInkPrintMode_OverCoatSpotColor
source: OverCoat Spot Color
chs: 专色盖顶
cht: 專色蓋頂
th: เคลือบเหนือจุดสี

# UILengthUnit_Inch
source: Inches
chs: 英寸
cht: 英寸
th: นิ้ว

# NoPreviewImage
source: No preview
chs: 无预视
cht: 無預視
th: ไม่มีตัวอย่าง

# UIError_CannotPrintStaus
source: Can not print job in status{0},Please try again later ?
chs: 打印机无法在{0}状态打印作业,稍后请重试.
cht: 打印機無法在{0}狀態打印作業,稍後請重試.
th: ไม่สามารถพิมพ์งานในสถานะ {0}.

# CalibrationDescription_Mechanical
source: Adjust head with tools.
chs: 使用机械工具校准.
cht: 使用機械工具校準.
th: ปรับหัวพิมพ์ด้วยเครื่องมือ.

# UISuccess_SetHWSetting
source: Set HW setting successfully.Please restart printer.
chs: 设定硬件设置成功.请重新启动打印机.
cht: 設定硬體設置成功.請重新啟動印表機.
th: การตั้งชุด hw ประสบความสำเร็จ โปรดสตาร์ทเครื่องพิมพ์ใหม่.

# UIError_GetHWSettingFail
source: Get HW setting failed!
chs: 获取硬件设定失败!
cht: 獲取硬體設定失敗!
th: ได้การตั้งค่า hw ล้มเหลลว!

# JobListColumnHeader_Resolution
source: Resolution
chs: 分辨率
cht: 解析度
th: ความละเอียด

# UIError_NoHelpFile
source: Help file not found.
chs: 未找到帮助文件。.
cht: 未找到幫助檔。.
th: ไม่พบแฟ้มข้อมูลการช่วยเหลือ.

# JetStatusEnum_Spraying
source: Spraying
chs: 闪喷
cht: 閃噴
th: การพ่น

# WhiteInkPrintMode_UnderBaseSpotColor
source: UnderBase Spot Color
chs: 专色铺底
cht: 專色鋪底
th: จุดสีข้างใต้ฐาน

# BoardEnum_HeadBoard
source: Head Board
chs: 头板
cht: 頭板
th: แผงหัวพิมพ์

# ColorEnum_LightCyan
source: LightCyan
chs: 浅青
cht: 淺青
th: สีฟ้าอ่อน

# JetStatusEnum_Busy
source: Printing
chs: 打印
cht: 列印
th: การพิมพ์

# Confirm_ClearEnv
source: Are you sure to clear environment?
chs: 您确认要清除环境设置吗?
cht: 您確認要清除環境設置嗎?
th: ท่านแน่ใจหรือว่าจะลบสภาพแวดล้อมทิ้ง?

# ColorEnum_White
source: White
chs: 白
cht: 白
th: สีขาว

# BoardEnum_CoreBoard
source: Core Board
chs: 核心板
cht: 核心板
th: แผงแกน

# FileFilter_Dat
source: Update Files (*.dat)|*.dat
chs: 升级文件 (*.dat)|*.dat
cht: 升級檔 (*.dat)|*.dat
th: ปรับปรุงแฟ้มข้อมูล (*.dat)|*.dat

# FileFilter_Prg
source: Update Files (*.prg)|*.prg
chs: 升级文件 (*.prg)|*.prg
cht: 升級檔 (*.prg)|*.prg
th: ปรับปรุงแฟ้มข้อมูล (*.prg)|*.prg

# FileFilter_Tvc
source: Temperature-voltage curve Files (*.tvc)|*.tvc
chs: 温度电压曲线文件 (*.tvc)|*.tvc
cht: 溫度電壓曲線文件 (*.tvc)|*.tvc

# DisplayTime_Minute
source: Minute
chs: 分钟
cht: 分鐘
th: นาที

# DispName_PrintingTotalTime
source: Printing total time
chs: 打印持续时间
cht: 列印持續時間
th: เวลาที่ใช้ในการพิมพ์ทั้งหมด

# CalibrationTitle_Calibration
source: Software Adjust
chs: 软件校准
cht: 軟體校準
th: ปรับซอฟท์แวร์

# DisplayTime_Hour
source: Hour
chs: 小时
cht: 小時
th: ชั่วโมง

# Restart_Lang
source: The language will take action after you re-launch.
chs: 语言设定将在重新启动程序后起作用。
cht: 語言設定將在重新啟動程式後起作用。
th: ภาษาจะทำงานหลังจากท่านเริ่มดำเนินการอีกครั้ง.

# Restart_Skin
source: The skin will take action after you re-launch.
chs: 皮肤设定将在重新启动程序后起作用。
cht: 皮膚設定將在重新啓動程序後起作用。

# UpdaterError_WrongFile
source: Invalid update file format
chs: 错误的升级文件格式
cht: 錯誤的升級檔格式
th: รูปแบบแฟ้มข้อมูลที่ปรับปรุงเป็นโมฆะ

# Suffix_UILengthUnit_Inch
source: in
chs: 英寸
cht: 英寸
th: นิ้ว

# UIViewMode_NotifyIcon
source: Notify Icon
chs: 托盘图标
cht: 託盤圖示
th: ไอคอนที่ใช้แจ้ง

# UIViewMode_OldView
source: Old View
chs: 老界面
cht: 老界面

# JetStatusEnum_Aborting
source: Aborting
chs: 中止
cht: 中止
th: การหยุดการทำงานทันที

# UpdateDisplay_Begin
source: Start Updating...
chs: 开始升级固件...
cht: 開始升級固件...
th: เริ่มต้นการปรับปรุง...

# CalibrationSubStep_Bidirection
source: Bidirection Calibration
chs: 双向校准
cht: 雙向校準
th: การคำนวณไปกลับ

# ButtonNext
source: &Next >
chs: 下一步(&N) >
cht: 下一步(&N) >
th: ถัดไป(&n)>

# Suffix_UILengthUnit_Centimeter
source: cm
chs: 厘米
cht: 釐米
th: เซนติเมตร

# PrintDirection_Bidirection
source: Bidirection
chs: 双向
cht: 雙向
th: ไปกลับ

# UILengthUnit_Meter
source: Meters
chs: 米
cht: 米
th: เครื่องวัด

# FileFilter_Prn
source: Rip Files (*.prn;*.prt)|*.prn;*.prt
chs: Rip 文件 (*.prn;*.prt)|*.prn;*.prt
cht: Rip 文件 (*.prn;*.prt)|*.prn;*.prt
th: แฟ้มข้อมูลริป(*.prn;*.prt)|*.prn;*.prt

# PrintDirection_Unidirection
source: Unidirection
chs: 单向
cht: 單向
th: ทิศทางเดียว

# JetStatusEnum_Updating
source: Updating
chs: 正在更新
cht: 正在更新
th: กำลังอัพเกรด

# UIViewMode_LeftRight
source: Wide Screen
chs: 宽屏
cht: 寬屏
th: จอกว้าง

# JetStatusEnum_Measuring
source: Measuring
chs: 测量
cht: 測量
th: กำลังวัดความกว้างกระดาษ

# CalibrationSubStep_Step
source: Step Calibration
chs: 进纸校准
cht: 進紙校準
th: การคำนวณขั้น

# InkStrPosEnum_Both
source: Both
chs: 两边
cht: 兩邊
th: ทั้งสอง

# DispName_ManufacturerID
source: Manufacturer ID
chs: 制造商ID
cht: 製造商ID
th: หมายเลขประจำตัวโรงงานผลิต

# UpdateDisplay_Percentage
source: % Complete
chs: % 完成
cht: % 完成
th: % เปอร์เซ็นต์ที่เสร็จสมบูรณ์แล้ว

# InkStrPosEnum_Right
source: Right
chs: 右
cht: 右
th: ขวามือ

# Confirm_SaveToBoard
source: Are you sure to replace board setting with current setting?
chs: 您确认要更新板子保存的设置吗?
cht: 您確認要更新板子保存的設置嗎?
th: ท่านแน่ใจหรือว่าจะแทนค่าแผงวงจรที่ตั้งไว้ด้วยค่าปัจจุบัน?

# UIError_ClearFWFactoryData
source: Clear factory data failed!
chs: 清除工厂数据失败!
cht: 清除工廠資料失敗!
th: ล้างข้อมูลโรงงานล้มเหลว!

# ColorEnum_Yellow
source: Yellow
chs: 黄
cht: 黃
th: สีเหลือง

# CalibrationDescription_Finish
source: Calibration has been finished.
chs: 校准完成.
cht: 校準完成.
th: เสร็จการคำนวณแล้ว.

# JobListColumnHeader_PrintedPasses
source: Printed Passes
chs: 实际的Passes
cht: 實際的Passes
th: จำนวนซ้ำที่พิมพ์

# Suffix_UILengthUnit_Feet
source: ft
chs: 英尺
cht: 英尺
th: ฟุต

# UIError_SetHWSettingFail
source: Set HW setting failed!
chs: 设定硬件设置失败!
cht: 設定硬體設置失敗!
th: การตั้ง ชุดhw ล้มเหลว!

# ColorEnum_Green
source: Green
chs: 绿
cht: 綠
th: สีเขียว

# UIError_NullFactoryData
source: Some setting items are not set. Please set all items!
chs: 某些条款没有设置。请设置所有条款。!
cht: 某些條款沒有設置。請設置所有條款。!
th: บางหัวข้อไม่ได้ถูกตั้ง โปรดตั้งค่าหัวข้อทั้งหมด!

# UIError_OnlyOneProgram
source: Can only run one program!
chs: 只能运行一个程序!
cht: 只能運行一個程式!
th: สามารถเปิดได้หนึ่งโปรแกรมเท่านั้น!

# UISuccess_UpdateSuccess
source: Update successfully.Please restart printer.
chs: 升级成功。请重新启动打印机。
cht: 升級成功。請重新啟動印表機。.
th: การปรับปรุงสำเร็จ โปรดสตาร์ทเครื่องพิมพ์ใหม่อีกครั้ง.

# UIError_ColorNumGroupNumError
source: The number of colors or the number of groups is set incorrectly, Whether to continue?
chs: 颜色数或组数设置错误,是否继续？
cht: 顔色數或組數設置錯誤,是否繼續？

# UIError_ColorNumError
source: Total number of colors than the system supports a maximum number of colors, Whether to continue?
chs: 颜色总数超过系统支持的最大颜色数, 是否继续?
cht: 顔色總數超過系統支持的最大顔色數, 是否繼續?

# UIError_SsystemMapDismatch
source: Port mapping set number less than the number of headboard.
chs: 端口映射设置数少于头板个数.
cht: 端口映射設置數少于頭板個數.

# Confirm_LoadFromBoard
source: Are you sure to load?
chs: 您确认要载入吗?
cht: 您確認要載入嗎?
th: ท่านแน่ใจหรือว่าจะอ่านข้อมูลมาไว้ในหน่วยความจำ?

# Confirm_GoHome
source: Do you want to move carriage to home station?
chs: 是否移动小车回起始点?
cht: 是否移动小车回起始点?

# Confirm_PrintNow
source: Now start to print?
chs: 现在要开始打印吗?
cht: 現在要開始打印嗎?

# Confirm_Print
source: No printing job was selected，Please select printing job first!
chs: 您未选择打印作业，请先选择打印作业！
cht: 您未選擇列印工作，請先選擇列印工作！

# ColorEnum_LightYellow
source: LightYellow
chs: 浅黄
cht: 淺黃

# ColorEnum_LightBlack
source: LightBlack
chs: 浅黑
cht: 淺黑

# ColorEnum_Red
source: Red
chs: 红
cht: 紅

# ColorEnum_Blue
source: Blue
chs: 蓝
cht: 藍

# ColorEnum_Vanish
source: Vanish
chs: 亮油
cht: 亮油

# ColorEnum_SkyBlue
source: SkyBlue
chs: 天蓝
cht: 天藍

# ColorEnum_Gray
source: Gray
chs: 灰
cht: 灰

# ColorEnum_Pink
source: Pink
chs: 粉红
cht: 粉紅

# ColorEnum_NULL
source: NULL
chs: 空
cht: 空
th: ไม่มีผล

# ColorEnum_LightMagenta
source: LightMagenta
chs: 浅品
cht: 淺品
th: สีแดงอ่อน

# UILengthUnit_Feet
source: Feet
chs: 英尺
cht: 英尺
th: ฟุต

# UISuccess_ClearFWFactoryData
source: Clear factory data successfully.
chs: 清除工厂数据成功.
cht: 清除工廠資料成功.
th: ล้างข้อมูลโรงงานสำเร็จ.

# JetStatusEnum_Cleaning
source: Cleaning
chs: 正在清洗
cht: 正在清洗
th: การทำความสะอาด

# UIError_SaveSetToBoardFail
source: Save printer settings to board failed!
chs: 保存打印机设置失败!
cht: 保存印表機設置失敗!
th: การบันทึกค่าที่ตั้งไว้ของเครื่องพิมพ์ไปยังแผงวงจรล้มเหลว!

# InkStrPosEnum_Left
source: Left
chs: 左
cht: 左
th: ซ้ายมือ

# JetStatusEnum_Unknown
source: Unknown Status
chs: 不知道的状态
cht: 不知道的狀態
th: สถานะที่ไม่มีใครทราบ

# UISuccess_ClearEnv
source: Clear environment successful.
chs: 清除环境成功。
cht: 清除環境成功。
th: จัดการสภาพแวดล้อมสำเร็จ.

# UISuccess_SetPassword
source: Set password successfully.
chs: 设置密码成功。
cht: 設置密碼成功。
th: การตั้งรหัสผ่านสำเร็จ โปรดสตาร์ทเครื่องพิมพ์ใหม่.

# UIError_NoAcrobat
source: Not found Acrobat Reader in this computer.
chs: 未找到 Acrobat Reader.
cht: 未找到 Acrobat Reader.
th: ไม่พบ อะโครแบท รีดเดอร์ ในคอมพิวเตอร์นี้.

# Confirm_ResetPrinter
source: Are you sure to reset printer?
chs: 您确认要重启打印机吗?
cht: 您確認要重啟印表機嗎?
th: ท่านแน่ใจหรือว่าจะตั้งค่าเครื่องพิมพ์ใหม่?

# UILengthUnit_Millimeter
source: Millimeters
chs: 毫米
cht: 毫米
th: มิลลิเมตร

# UIError_SetPasswordFail
source: Set password failed!
chs: 设置密码失败!
cht: 設置密碼失敗!
th: การตั้งรหัสผ่านล้มเหลว!

# buttonFinish_Text
source: Finished
chs: 完成
cht: 完成
th: เสร็จสิ้น

# JetStatusEnum_Ready
source: Ready
chs: 就绪
cht: 就緒
th: พร้อม

# UpdateDisplay_Failed
source: Update failed!
chs: 升级失败!
cht: 升級失敗!
th: อัพเกรดล้มเหลว!

# JobListColumnHeader_Copies
source: Copies
chs: 打印份数
cht: 列印份數
th: สำเนาพิมพ์

# Suffix_UILengthUnit_Millimeter
source: mm
chs: 毫米
cht: 毫米
th: มิลลิเมตร

# JobStatus_Idle
source: Idle
chs: 空闲
cht: 空閒
th: อยู่เฉยๆ

# JetStatusEnum_PowerOff
source: Power Off
chs: 电源关闭
cht: 電源關閉
th: ปิด

# DispName_Head
source: Head
chs: 头
cht: 頭
th: หัวพิมพ์

# DispName_Color
source: Color
chs: 色
cht: 色
th: สี

# JetStatusEnum_Moving
source: Moving
chs: 正在移动
cht: 正在移動
th: การเคลื่อนที่

# CalibrationSubStep_Horizontal
source: Horizontal Calibration
chs: 水平对齐校准
cht: 水準對齊校準
th: การคำนวณแนวระนาบ

# CaliWizard_Finish
source: The calibration wizard finished successfully.
chs: 校准向导成功完成.
cht: 校準嚮導成功完成.
th: คำนวณตามแบบสำเร็จรูปเสร็จสมบูรณ์.

# DisplayTime_Second
source: Second
chs: 秒
cht: 秒
th: ลำดับที่สอง

# ColorEnum_Black
source: Black
chs: 黑
cht: 黑
th: ดำ

# DispName_RemainTime
source: Remain time
chs: 剩余时间
cht: 剩餘時間
th: เวลาที่ยังเหลืออยู่

# JobStatus_Error
source: Error
chs: 错误
cht: 錯誤
th: ข้อบกพร่อง

# InkStrPosEnum_None
source: None
chs: 无
cht: 無
th: ไม่มี

# DispName_ModuleID
source: Module ID
chs: 模块ID
cht: 模組ID
th: เลขประจำตัว id

# CalibrationTitle_Welcome
source: Welcome
chs: 欢迎
cht: 歡迎
th: ยินดีต้อนรับ

# JobStatus_Aborting
source: Aborting
chs: 中止
cht: 中止
th: การหยุดการทำงานทันที

# PrintingProgress
source: Printing {0}%
chs: 打印 {0}%
cht: 列印 {0}%
th: ปริมาณ{0} % การพิมพ์

# JobListColumnHeader_PrintTime
source: Print Time
chs: 打印耗时
cht: 列印耗時
th: เวลาที่พิมพ์

# JobListColumnHeader_Location
source: Location
chs: 文件位置
cht: 檔位置
th: สถานที่

# JobListColumnHeader_BiDirection
source: Direction
chs: 方向
cht: 方向
th: ทิศทาง

# JobStatus_Printing
source: Printing
chs: 打印
cht: 列印
th: การพิมพ์

# UISuccess_SaveSetToBoardSuccess
source: Save printer settings to board successfully!
chs: 保存打印机设置成功!
cht: 保存印表機設置成功!
th: การบันทึกค่าที่ตั้งไว้ของเครื่องพิมพ์ไปยังแผงวงจรประสบความสำเร็จ!

# UpdateDisplay_Status
source: Update status:
chs: 升级状态:
cht: 升級狀態:
th: ปรับปรุงสถานะ:

# ColorEnum_Magenta
source: Magenta
chs: 品红
cht: 品紅
th: สีแดง

# CalibrationTitle_Mechanical
source: Mechanical Check
chs: 机械检查
cht: 機械檢查
th: การตรวจดูเชิงกล

# UIError_SetOriginFailed
source: Can not set this point as origin.
chs: 此点不能设置为原点。.
cht: 此點不能設置為原點。.
th: ไม่สามารถตั้งจุดนี้เสมือนจุดกำเนิดได้.

# UISuccess_RstoreSetting
source: Restore setting successful.
chs: 恢复设置成功。.
cht: 恢復設置成功。.
th: การเก็บรักษาการตั้งค่าประสบความสำเร็จ.

# PrintJobAnyway
source: Would you like to print job anyway?
chs: 您还需要打印它吗?
cht: 您還需要列印它嗎?
th: ท่านต้องการพิมพ์งานหรือไม่?

# UpdateDisplay_Success
source: Update successfully.Please restart printer.
chs: 升级成功。请重新启动打印机。.
cht: 升級成功。請重新啟動印表機。.
th: การปรับปรุงสำเร็จ โปรดสตาร์ทเครื่องพิมพ์ใหม่อีกครั้ง.

# SpeedEnum_MiddleSpeed
source: Middle Speed
chs: 中速
cht: 中速
th: ความเร็วปานกลาง

# SpeedEnum_MiddleSpeed_1
source: Standard Speed
chs: 标准
cht: 標準
th: มาตรฐาน

# Confirm_AbortPrinter
source: Are you sure to abort current printing jobs or all unprinted jobs?
chs: 您确认要取消正在打印的作业还是所有未打印的作业?
cht: 您確認要取消正在列印的作業還是所有未列印的作業?
th: ท่านแน่ใจหรือว่าจะหยุดการพิมพ์งานต่างๆ?

# JetStatusEnum_Offline
source: Offline
chs: 离线
cht: 離線
th: ไม่เชื่อมต่อ

# CalibrationSubStep_Right
source: Right Calibration
chs: 右校准
cht: 右校準
th: การคำนวณด้านขวา

# CaliWizard_Title
source: Calibration Wizard
chs: 校准向导
cht: 校準嚮導
th: วิธีการคำนวณสำเร็จรูป

# JobStatus_Paused
source: Paused
chs: 暂停
cht: 暫停
th: หยุดชั่วคราว

# CaliWizard_Description
source: Fill the value as the printed image.
chs: 根据校准图填写数值.
cht: 根據校準圖填寫數值.
th: เติมค่าที่เสมือนภาพพิมพ์.

# CalibrationDescription_Welcome
source: Start calibration ...
chs: 开始校准...
cht: 開始校準...
th: เริ่มคำนวณ...

# FW_Voltage
source: Voltage correct
chs: 电源电压设置正确
cht: 電源電壓設置正確

# SettingPage_Question
source: Whether or not to Apply the setting has been changed?
chs: 是否应用已更改的设置?
cht: 是否應用已更改的設置?
th: จะใช้ค่าที่ถูกเปลี่ยนแปลงหรือไม่?

# CreatingPreviewImage
source: Generating preview ...
chs: 正在生成预览...
cht: 正在生成預覽...
th: การสร้างตัวอย่าง...

# JHFCopyRightString
source: Copyright (C) QHH Information Technology Co., Ltd. All rights reserved.
chs: 版权所有 (C) 勤恒和信息技术（北京）有限公司. 保留所有权利.
cht: 版權所有 (C) 勤恒和資訊技術（北京）有限公司. 保留所有權利.
th: ลิขสิทธิ์ © บริษัท qhh information technology จำกัด สงวนสิทธิ์ทุกประการ.

# Confirm_Update
source: Are you sure want to update?
chs: 您确定要升级?
cht: 您確定要升級?
th: ท่านแน่ใจหรือว่าต้องการปรับปรุงให้ทันสมัย?

# EncryptDog_Expired
source: Your software has expired!
chs: 您的软件已过期!
cht: 您的軟體已過期!
th: ซอฟท์แวร์ของท่านหมดอายุ!

# EncryptDog_VidNotMatch
source: Dongle is not match with printer manufacture!
chs: 加密锁与打印机厂商不匹配!
cht: 加密锁与打印机厂商不匹配!

# EncryptDog_Illegal
source: Security hardware key illegal or damaged!
chs: 加密锁不合法或者已损坏!
cht: 加密鎖不合法或者已損壞!
th: กุญแจเครื่องมือรักษาความปลอดภัยผิดกฎหมายหรือเสียหาย!

# EncryptDog_NoFound
source: Not found Security hardware key. Please insert one!
chs: 未发现加密锁,请插入合法加密锁!
cht: 未發現加密鎖,請插入合法加密鎖!
th: ไม่พบกุญแจเครื่องมือรักษาความปลอดภัย, โปรดใส่กุญแจเข้าไป!

# EncryptDog_Warning
source: Warning: less than 100 hours available time!
chs: 警告:您的可用时间不足100小时!
cht: 警告:您的可用時間不足100小時!
th: คำเตือน : มีเวลาเหลืออีกน้อยกว่า 100 ชั่วโมง!

# EncryptDog_Locktype_LOCAL
source: desktop version
chs: 单机锁
cht: 單機鎖
th: รุ่นของเดสทอป

# EncryptDog_Locktype_MASTER
source: network version - master device
chs: 网络主锁
cht: 網路主鎖
th: รุ่นของเครือข่าย – อุปกรณ์ตัวแม่

# EncryptDog_Locktype_SLAVE
source: network version - slave device
chs: 网络从锁
cht: 網路從鎖
th: รุ่นของเครือข่าย – อุปกรณ์ตัวลูก

# EncryptDog_Restart
source: The New Dongle key will take action after you re-launch!
chs: 新软件狗密码将在重新启动程序后起作用!
cht: 新軟體狗密碼將在重新啟動程式後起作用!
th: กุญแจดองเกิ้ลอันใหม่จะทำงานหลังท่านเริ่มดำเนินการใหม่!

# EncryptDog_Fatalpwd
source: Permanent and effective password
chs: 永久有效
cht: 永久有效
th: รหัสผ่านถาวรและใช้ได้

# PumpInkTimeToLong
source: Pump ink overtime
chs: 泵墨超时
cht: 泵墨超時

# FeatherType_Gradient
source: Gradient
chs: 渐变
cht: 漸變

# FeatherType_Uniform
source: Uniform
chs: 均匀
cht: 均勻

# FeatherType_Wave
source: Wave
chs: 波浪
cht: 波浪

# FeatherType_Advance
source: Advance
chs: 高级
cht: 高級

# FeatherType_Joint
source: Joint
chs: 噴頭間
cht: 喷头间

# EpsonFeatherType_None
source: None
chs: 关
cht: 關

# EpsonFeatherType_Small
source: Weak
chs: 弱
cht: 弱

# EpsonFeatherType_Medium
source: Medium
chs: 中
cht: 中

# EpsonFeatherType_Large
source: Strong
chs: 强
cht: 強

# EpsonFeatherType_SuperLarge
source: SuperLarge
chs: 超强
cht: 超強

# EpsonFeatherType_Custom
source: Custom
chs: 自定义
cht: 自定義

# UIError_GetRealTimeInfoFail
source: Get RealTime Information Fail!
chs: 读取实时信息失败!
cht: 讀取實時信息失敗!

# Xaar382_UnsavedWarning
source: Are you sure you want to give up the unsaved changes?
chs: 您确定放弃未保存的变更吗?
cht: 您確定放棄未保存的變更嗎?

# EpsonAutoCleanWay_Default
source: Default
chs: 默认
cht: 默認

# EpsonAutoCleanWay_Customized
source: Customized
chs: 自定义
cht: 自定義

# EpsonAutoCleanWay_Strong
source: Strong
chs: 强
cht: 強

# EpsonAutoCleanWay_Normal
source: Normal
chs: 中
cht: 中

# EpsonAutoCleanWay_Weak
source: Weak
chs: 弱
cht: 弱

# EpsonAutoCleanWay_Refill
source: Refill
chs: 填充
cht: 填充

source: FixedSpeed
chs: 定速
cht: 定速

# ClampWithMinMax
source: Value is too large or too small, has been fixed as a legal value.
chs: 值太大或太小,已修正为合法值.
cht: 值太大或太小,已修正為合法值.

# WhiteInkOptionIntersect
source: Intersect
chs: 交集
cht: 交集

# WhiteInkOptionNOT
source: NOT
chs: 取反
cht: 取反

# EnumLayerType_Color
source: Color
chs: 彩色
cht: 彩色

# EnumLayerType_White
source: White
chs: 白墨
cht: 白墨

# EnumLayerType_Varnish
source: Varnish
chs: 亮油
cht: 亮油

# EnumLayerType_Contrast
source: Gray
chs: 灰
cht: 灰

# ColorLayer
source: Layer
chs: 层
cht: 層

# NoFoundUSBReturn
source: Not connected usb, software initiates termination.
chs: 未连接usb,软件启动终止.
cht: 未連接usb,軟件啓動終止.

# MultipleInkEnum_Default
source: Default
chs: 默认
cht: 默認

# MultipleInkEnum_Double
source: Double
chs: 俩倍
cht: 倆倍

# MultipleInkEnum_More
source: More
chs: 多倍
cht: 多倍

# XResDivMode_HighPrecision
source: HighPrecision
chs: 高精度
cht: 高精度

# XResDivMode_HighQuality
source: HighSpeed
chs: 高速度
cht: 高速度

# EpsonSaveCali_Ok
source: Successfully loaded.
chs: 保存成功.
cht: 保存成功.

# EpsonLoadCali_Faild
source: Failed to load.
chs: 加载失败.
cht: 加載失敗.

# EpsonLoadCali_Ok
source: Successfully loaded.
chs: 加载成功.
cht: 加載成功.

# EpsonLoadCali_VerTooOld
source: The upgrade version lower than the basic version.
chs: 升级的版本低于基础版本.
cht: 升級的版本低于基礎版本.

# EpsonLoadCali_VerTooLatest
source: The upgrade version is higher than the current highest version.
chs: 升级的版本不支持，高于当前最高版本.
cht: 升級的版本不支持，高于當前最高版本.

# EpsonLoadCali_SizeError
source: setup length error.
chs: 加载数据大小错误.
cht: 加載數據大小錯誤.

# EpsonLoadCali_FlagError
source: Flag error.
chs: Flag 错误.
cht: Flag 錯誤.

# EpsonLoadCali_GetSizeFaild
source: Failed to get transmission data length.
chs: 获取待传输大小失败.
cht: 獲取待傳輸大小失敗.

# EpsonLoadCali_GetRetFaild
source: Failed to get Load result.
chs: 获取返回结果失败.
cht: 獲取返回結果失敗.

# UiToolBar_MeasurePaperHeight
source: Measure paper height
chs: 测量纸高
cht: 測量紙高

# XCoordinatesDirection_Default
source: Default
chs: 默认
cht: 默認

# XCoordinatesDirection_YcontinueYinterleave
source: YcontinueYinterleave
chs: Y拼接Y拼插
cht: Y拼接Y拼插

# XCoordinatesDirection_YinterleaveYcontinue
source: YinterleaveYcontinue
chs: Y拼插Y拼接
cht: Y拼插Y拼接

# SymmetricType_Type0
source: Type 0
chs: 方式 0
cht: 方式 0

# SymmetricType_Type1
source: Type 1
chs: 方式 1
cht: 方式 1

# UIError_YInterleaveNumError
source: When symmetric color order, Y interleave number must be a multiple of 2
chs: 对称色序时,Y拼插数必须是2的倍数.
cht: 對稱色序時,Y拼插數必須是2的倍數.

# UVStatus_OFF
source: OFF
chs: 关
cht: 關

# UVStatus_ALLWIN_OFF
source: OFF
chs: 关
cht: 關

# UVStatus_ALLWIN_LOW
source: LOW
chs: 低
cht: 低

# UVStatus_ALLWIN_MID
source: MIDDLE
chs: 中
cht: 中

# UVStatus_ALLWIN_HIGH
source: HIGH
chs: 高
cht: 高

# EpsonFeatherType_GZ_LOW
source: LOW
chs: 低
cht: 低

# EpsonFeatherType_GZ_MID
source: MIDDLE
chs: 中
cht: 中

# EpsonFeatherType_GZ_HIGH
source: HIGH
chs: 高
cht: 高

# EpsonFeatherType_Label
source: Quality:
chs: 质量:
cht: 質量:

# Title_wellcomeWord
source: Thank you for using Allwin digital printer
chs: 感谢使用allwin数码打印机
cht: 感謝使用allwin數碼印表機
