Repository: 6555355/Scan_yan1
Catalog: PrinterStubC/Resource/ResString.*-*.resx
Languages: chs, cht, th

# Conten_wellcomeWord
source: First --Please use allwin orginal ink： 1）the ink is environment protection and low Odor, it is stale and smoothly during printing, it can improve yield effectly and reduce the cost； 2）Prolong the lifetime of the nozzle. Second--Machine environment requirement： ink temperature 18-27℃，air moisture40-70%，the environment without dust； 1）when the tempareture lower than 15℃，（konica）open the heating function of the sub inktank, at the same time the ink bottle can be packed by electric blanket or other heating method to make the ink temperature be 30℃, open printhead heating function(1024 machine with this function)； 2）when ink tube insert ink bottle, the hole please be smaller and the lid keep sealed to reduce the ink volatilized and prevent the dust get into it. 3 when pringt in winter, it can open spray for 10 minute to preheat( epson machine don’t need this step)； 4）please check the ink tube whether with bubble, if it has the bubble please except it firstly； 5）The picture add test bar in the two sides to prevent the nozzle clog caused by ink too less when printing.
chs: 一. 请使用奥威原厂墨水： 1）环保低气味，打印流畅稳定，有效提高成品率，降低成本； 2）延长喷头使用寿命， 二. 机器环境要求： 墨水温度18-27℃，空气湿度40-70%，环境无灰尘； 1）环境温度低于15℃时，（喷绘机）打开二级墨盒加热功能，同时墨桶可以用电热毯包裹或其他加热方式，使墨水加热到恒温30℃，打开喷头加热功能（1024机型配有此功能）； 2）墨管插入墨桶时，开孔尽量小，桶盖保持密闭，减少墨水挥发和防止灰尘进入（ 3）冬季打印时可以先开机闪喷预热喷头10分钟（写真机无需此步骤）； 4）检查墨管中是否有气泡，如果有，要先排除； 5）画面两侧加上测试条，预防打印墨量少的画面时喷头堵塞。
cht: 一. 請使用奧威原廠墨水： 1）環保低氣味，列印流暢穩定，有效提高成品率，降低成本； 2）延長噴頭使用壽命， 二. 機器環境要求： 墨水溫度18-27℃，空氣濕度40-70%，環境無灰塵； 1）環境溫度低於15℃時，（噴繪機）打開二級墨水匣加熱功能，同時墨桶可以用電熱毯包裹或其他加熱方式，使墨水加熱到恒溫30℃，打開噴頭加熱功能（1024機型配有此功能）； 2）墨管插入墨桶時，開孔儘量小，桶蓋保持密閉，減少墨水揮發和防止灰塵進入； 3）冬季列印時可以先開機閃噴預熱噴頭10分鐘（寫真機無需此步驟）； 4）檢查墨管中是否有氣泡，如果有，要先排除； 5）畫面兩側加上測試條，預防列印墨量少的畫面時噴頭堵塞。

# Title_firstPage
source: First--About opening machine：
chs: 一.开机使用：
cht: 一.開機使用：

# Title_secondPage
source: Second-- Device maintance common method
chs: 二.设备一般维护方法
cht: 二.設備一般維護方法

# Title_thirdPage
source: Third:Equipment regular maintenance specification
chs: 三.设备定期保养规范
cht: 三.設備定期保養規範

# Conten_firstPage
source: 1、firstly please pull up the fixed screw(konica)，the carriage move to left slowly and then seprate from bottom base. 2、move out the carriage(konica)，On the base of rubber covered with a layer of plastic wrap to prevent dust. 3 before start the machine, please check whether with some dirty things to prevent damage the print head. 4. The ink tube should without bubble or will cause to break line when printing, it needs to expel the bubble then print； 5. Please don’t let the print head leave capping and expose on the air. If the stop time is long, please set spray in the software; when the epson machine don’t use please click reset function to make capping match printhead. 6.Inkjet equipment with allwin encoder Patent configuration function , when the picture need to title please open software function operate manual to guide using encoder function so that can ensure the quality of titling.
chs: 1、先拔起固定螺栓（喷绘机），小车向左缓慢移动，与底座分离。 2、移出喷车后（喷绘机），在底座橡皮上覆盖一层保鲜膜防止灰尘。 3 开机前请检查机器平台上是否的异物，以免划伤喷头； 4. 墨管中不应有气泡，否则可能导致打印断墨水，需要排出空气后使用； 5. 不要让喷头长期离开保养墨栈暴露在空气下。若停顿时间较长，请在软件内设置合适的闪喷值；写真机不用时点复位功能，使墨盏和喷头吻合保护 6.带有allwin码盘专利配置功能的喷绘设备，需要拼接画面时，打开软件功能按照操作手册指导使用码盘功能，可确保高质量拼接。
cht: 1、先拔起固定螺栓（噴繪機），小車向左緩慢移動，與底座分離。 2、移出噴車後（噴繪機），在底座橡皮上覆蓋一層保鮮膜防止灰塵。 3 開機前請檢查機器平臺上是否的異物，以免劃傷噴頭； 4. 墨管中不應有氣泡，否則可能導致列印斷墨水，需要排出空氣後使用； 5. 不要讓噴頭長期離開保養墨棧暴露在空氣下。若停頓時間較長，請在軟體內設置合適的閃噴值；寫真機不用時點復位功能，使墨盞和噴頭吻合保護 6.帶有allwin碼盤專利配置功能的噴繪設備，需要拼接畫面時，打開軟體功能按照操作手冊指導使用碼盤功能，可確保高品質拼接。

# Conten_secondPage
source: If the picture shows break line during printing, please deal with as following methods： 1）please abserve the surface of the head with flashlight: if find there with gathered ink please clean it with vacuum cleaner or with non-woven fabrics to rub it lightly, if don’t have gathered ink please use press ink function then press the ink will be OK. Then use non-woven fabrics to absord other ink. 2. When use the non-woven fabrics rub the printhead surface, please don’t rub one printhead back and forth, rubbing the printhead just to absorb the ink. 3 close the machine maintance, firstly, please fill cleaner into moisture base rubber on the right, move the crriage to the last right to make printhead match with moisture base completely. 4、cleaning maintance： 1、please clean the moisture base rubber and impurity. 2、please pull out the cleaner form rubber base, then clean it and fill in new cleaner every week.
chs: 喷头打印过程中如果断线，建议表面处理的方式： 1）用手电筒观察喷头表面：如果有聚墨，使用自动吸尘器清洁或轻托无纺布向上， 吸去多余墨水；如果无聚墨，使用压墨功能，压下几滴墨水即可。再轻托无纺布吸去多余墨水。 2. 请使用工厂提供的无纺布轻擦喷头表面，严禁来回擦同一个喷头，擦喷头的目的仅仅为了吸去多余墨水。 3 关机维护 先在右侧的保湿底座橡皮内注满清洗液，推动喷车到最右侧使喷头与保湿底座完全吻合。 4、清洁维护： 1、每日清洁保湿底座橡皮及周边的杂质。 2、每周将橡皮座内清洗液抽出，清洗干净，注满新的清洗液。
cht: 噴頭列印過程中如果斷線，建議表面處理的方式： 1）用手電筒觀察噴頭表面：如果有聚墨，使用自動吸塵器清潔或輕托無紡布向上， 吸去多餘墨水；如果無聚墨，使用壓墨功能，壓下幾滴墨水即可。再輕托無紡布吸去多餘墨水。 2. 請使用工廠提供的無紡布輕擦噴頭表面，嚴禁來回擦同一個噴頭，擦噴頭的目的僅僅為了吸去多餘墨水。 3 關機維護 先在右側的保濕底座橡皮內注滿清洗液，推動噴車到最右側使噴頭與保濕底座完全吻合。 4、清潔維護： 1、每日清潔保濕底座橡皮及周邊的雜質。 2、每週將橡皮座內清洗液抽出，清洗乾淨，注滿新的清洗液。

# Conten_thirdPage
source: 1.please clean the scrape in the sub inktank in every winter to prevent the ink stay at the buttom of the ink tank then cause to clog ink tube and ink head. 2.Clean moisture capping every month and clean the cleaner under the capping. 3.Clean printhead surface: when the printhead surface or two sides with dirty things, please clean the printhead surface with cleaner. 4. Feeding roller requirement：please change foam paper regularly；rub the surface of the roller 5. Please clean the ink marks on the rubber pinch roller with alcohol and Cotton silk stuff beside the pinch roller. 6. Raster bar cleaning：abserve and clean everyday; use swab adding some distilled water and alcohol to scrab dust and dirty things； 7. X,Y direction tension inspection：inspect it every three month, if it’s loosed please adjust it； 8. Please clean the abandon ink of vacuum cleaner and waste cartridge regularly.
chs: 1. 每年冬季应定期清理二级墨盒内残渣，以防墨水沉淀在墨盒底部进入管道堵塞管路及墨头； 2. 每月对保湿墨盏进行清洁，定时将墨盏下的清洗液清理干净； 3. 清洁喷头表面：当喷头表面或两侧有脏物时，可以用清洗液注在喷头表面清洁； 4. 送料辊要求：定期更换发泡纸；擦拭辊子表面 5. 定期用酒精清理橡胶压轮上面的墨迹，和压轮两边上面的棉丝杂物； 6. 光栅条清洁：每日观察，每周清洁。棉签加蒸馏水或酒精轻轻擦拭去除灰尘或脏物； 7. X,Y方向皮带张紧力检查：每三个月检查一次，如有松了，要调整； 8. 吸尘器、废墨盒定期清除里面的废墨。
cht: 1. 每年冬季應定期清理二級墨水匣內殘渣，以防墨水沉澱在墨水匣底部進入管道堵塞管路及墨頭； 2. 每月對保濕墨盞進行清潔，定時將墨盞下的清洗液清理乾淨； 3. 清潔噴頭表面：當噴頭表面或兩側有髒物時，可以用清洗液注在噴頭表面清潔； 4. 送料輥要求：定期更換發泡紙；擦拭輥子表面 5. 定期用酒精清理橡膠壓輪上面的墨蹟，和壓輪兩邊上面的棉絲雜物； 6. 光柵條清潔：每日觀察，每週清潔。棉簽加蒸餾水或酒精輕輕擦拭去除灰塵或髒物； 7. X,Y方向皮帶張緊力檢查：每三個月檢查一次，如有松了，要調整； 8. 吸塵器、廢墨水匣定期清除裏面的廢墨。

# Title_finishPage
source: Operation Wizard
chs: 操作向导
cht: 操作嚮導

# Description_finishPage
source: Operation Wizard has been finished!
chs: 注意事项向导完成!
cht: 注意事項嚮導完成!

source: Ink usage statistics
chs: 墨水统计
cht: 墨水統計

# FaildGenDoubleSideFile
source: Failed to generate double-sided print files.
chs: 生成双面打印文件失败.
cht: 生成雙面打印文件失敗.

# CurSystemNoSurpportThisFeature
source: The current system does not support this function.
chs: 当前系统不支持此功能.
cht: 當前系統不支持此功能.

# GetWrongInfo
source: Get info erro,return original value!
chs: 得到的信息有误,已重置!
cht: 得到的信息有誤,已重置!

# UIError_EnumUSBFail
source: Enum USB Fail!
chs: 枚举USB失败!
cht: 枚舉USB失敗！

# UIError_FWFactoryDataDiffer
source: Factory data of two mainbord differ!
chs: 双主板工厂数据设置不一致!
cht: 雙主板工廠數據設定不一致！

# UIInfo_FactoryDataValue
source: Factory data {0}
chs: 工厂参数{0}值
cht: 工廠參數{0}值

# UIError_NoUSB
source: USB Disconnected!
chs: 未连接USB
cht: 未連接USB

# UIError_SetCleanParamFail
source: Set Clean Parameter error!
chs: 设置清洗参数失败!
cht: 設置清洗參數失敗!

# UIError_ManualCleanNotSupport
source: The current FW driver version does not support manual cleaning function, please upgrade!
chs: 当前FW驱动版本不支持手动清洗功能，请升级!
cht: 當前FW驅動版本不支援手動清洗功能，請升級!

# JobID3D
source: Printing layer:
chs: 当前打印层:
cht: 當前打印層:

# PauseBetweenLayersStatus
source: Pause Between Layers
chs: 层间暂停
cht: 層間暫停

# Pumping_Ink
source: Pumping {0}.
chs: {0}正在泵墨.
cht: {0}正在泵墨.

# CanleType_PrintingJob
source: Printing Job
chs: 取消当前
cht: 取消當前

# CanleType_All
source: All Job
chs: 取消全部
cht: 取消全部

# CanleType_AlwaysQuestion
source: Always Question
chs: 总是询问
cht: 總是詢問

# HorizontalCalibrationMode_Color
source: ColorCalibration
chs: 颜色校准
cht: 顏色校準

# HorizontalCalibrationMode_Full
source: FullCalibration
chs: 全校准
cht: 全校準

# HorizontalCalibrationMode_Quick
source: QuickCalibration
chs: 快速校准
cht: 快速校準

# HorizontalCalibrationMode_FullNoStep
source: GroupCalibration
chs: 组内校准
cht: 组内校準

# CalibrationSubStep_Origin
source: Orgin Calibration
chs: 原点校准
cht: 原點校準

# PrintTemperatureWarning
source: Whether print temperature reaches the set value?
chs: 打印温度是否达到了设定值?
cht: 打印溫度是否達到了設定值?

# Software_AWB_JobSettingError
source: The current print mode is AWB,but job setting error, can't print.
chs: 当前为AWB模式,作业设置错误,无法打印.
cht: 當前為AWB模式,作業設置錯誤,無法打印.

# Software_3D_LayerIndexError
source: The layer number currently being added to the print queue is not continuous with the layer number being printed. Are you sure you want to add it? "Yes", continue; "No", Cancel.
chs: 当前要添加到打印队列的层编号与正在打印的层编号不连续,确定要添加嘛?"是",继续;"否",取消.
cht: 當前要添加到打印隊列的層編號與正在打印的層編號不連續,確定要添加嘛?"是",繼續;"否",取消.

# Confirm_DeleteMode
source: Do you want to remove mode {0}
chs: 是否删除模式 {0}

# AutoJumpWhite
source: AutoSkipWhite
chs: 自动跳白

source: BetweenNozzleFeather
chs: 喷头间羽化

source: Bidirection
chs: 双向

source: Feather
chs: 羽化强度

source: FeatherType
chs: 羽化类型

source: IntensityFeather
chs: 增强羽化

source: MultipleInk
chs: 多倍墨量

source: PrintMode
chs: 打印模式

source: ReversePrint
chs: 反向打印

source: Speed
chs: 喷车速度

source: MirrorX
chs: 镜像

source: LeftLightLeftPrint
chs: 左打印时左灯开

source: LeftLightRightPrint
chs: 右打印时左灯开

source: RightLightLeftPrint
chs: 左打印时右灯开

source: RightLightRightPrint
chs: 右打印时右灯开

source: RepeatPrint
chs: 反向打印

# BladeDelayStopTime
source: Blade delay stop time(ms):
chs: 刮片延时停止时间(ms):
cht: 刮片延時停止時間(ms):

# CleaningSpeed
source: Cleaning speed(Hz):
chs: 清洗速度(Hz):
cht: 清洗速度(Hz):

source: Exquisite Feather
chs: 精细羽化
cht: 精細羽化

source: Feather Percent
chs: 羽化类型值
cht: 羽化類型值

source: Feather Custom
chs: 羽化强度值
cht: 羽化強度值

# StrCurYearAmountInTotal
source: This year's total
chs: 年度合计
cht: 年度合計

# StrHistoryAmountInTotal
source: Over the years in total
chs: 历年合计
cht: 曆年合計

# QuestionSynchronizeInkAndArea
source: Detect replaced the main board,Whether the synchronization of ink statistics?
chs: 检测到更换了主板,是否同步墨量统计数据?
cht: 檢測到更換了主板,是否同步墨量統計數據?

# SynchronizeInkAndAreaSuccess
source: Synchronization of ink statistical data successfully.
chs: 同步墨量统计数据成功.
cht: 同步墨量統計數據成功.

# SynchronizeInkAndAreaFail
source: Synchronization of ink statistics data fail.
chs: 同步墨量统计数据失败.
cht: 同步墨量統計數據失敗.

# UIError_TriggerFail
source: Trigger Fail!
chs: 触发失败！
cht: 觸發失敗！

# UISuccess_SetCleanParamSuccess
source: Set Clean Parameter Success!
chs: 设置清洗参数成功!
cht: 設定清洗參數成功！

# UISuccess_TriggerSuccess
source: Trigger Success!
chs: 触发成功！
cht: 觸發成功！

# ActualNumStr
source: Actual number of connections:
chs: 实际连接喷头数量：
cht: 實際連接噴頭數量：

# NoPassNumStr
source: The requested nozzles include:
chs: 没通过的喷头有：
cht: 沒通過的噴頭有：

# PassNumStr
source: Number of Nozzles requested:
chs: 通过请求喷头数量：
cht: 通過請求噴頭數量：

# TotalReqNumStr
source: Total number of nozzle requested:
chs: 总请求连接喷头数量：
cht: 總請求連接噴頭數量：

# StrDryOffsetDistance
source: Dry Offset Distance
chs: 烘干偏移距离
cht: 烘乾偏移距離

# StrDryInAdvance
source: Dry In Advance
chs: 烘干提前距离
cht: 烘乾提前距離

# StrFwNoSurportDoubleY
source: The software supports dual y-axis functions but fails to get the parameters. The fw may not support this feature.
chs: 软件支持双y轴功能,但获取参数失败.可能是升级包不支持此功能.
cht: 軟件支持雙y軸功能,但獲取參數失敗.可能是升級包不支持此功能.

# UIInfo_FactoryDataValue1
source: Factory data {0}
chs: 工厂参数{0}值
cht: 工廠參數{0}值

# strFwVersionError
source: The mainboard upgrade package version does not match!
chs: 主板升级包版本不匹配!

# StrMeasureZMaxMsg
source: Before measuring, please make sure that the resolution of the z-axis encoder and detector length are correct. Moreover, no medium is placed at the measuring point.
chs: 测量前,请确认z轴编码器分辨率和探头长度是正确的.而且测量点没有放置任何介质.
cht: 測量前,請確認z軸編碼器分辨率和探頭長度是正確的.而且測量點沒有放置任何介質.

# StrZMaxTooShort
source: Z axis max lenght value is too small!
chs: Z轴总行程值过小!
cht: Z軸總行程值過小!

# StrMesureResultError
source: Abnormal measurement results!("zMaxPos" less than 0)
chs: 测量结果异常!("zMaxPos"小于0)
cht: 測量結果異常!("zMaxPos"小於0)

# VersionCheck_Download
source: Download new version
chs: 下载新版本
cht: 下載新版本

# VersionCheck_HB_Reason
source: Update reason: {0}
chs: 更新原因：{0}
cht: 更新原因：{0}

# VersionCheck_HB_Version
source: Current HB version need to be updated, new version [{0}]
chs: 当前头板版本需要更新, 新版本[{0}]
cht: 當前頭板版本需要更新, 新版本[{0}]

# VersionCheck_Support
source: Please contact technical support
chs: 请联系技术支持人员
cht: 請聯繫技術支持人員

# UIError_Error
source: Error!
chs: 失败!
cht: 失敗!

# UISuccess_Success
source: Success!
chs: 成功!
cht: 成功!

# HB_Version_Low
source: Headboard program version is too low, please update the latest headboard program!
chs: 头板程序版本过低，请更新最新头板程序！
cht: 頭板程序版本過低，請更新最新頭板程序！

source: Application of motor parameters failed!
chs: 应用电机参数失败!
cht: 應用電機參數失敗！

source: Background Worker Is Busy!
chs: 线程忙！
cht: 線程忙！

# BiaxialDeviationScaleCoefficient
source: Biaxial deviation scale coefficient cannot be 0.
chs: 双轴偏差比例系数不能为0.
cht: 雙軸偏差比例係數不能為0.

source: Color Negative Pressure Error|
chs: 彩色负压出错|
cht: 彩色負壓出錯|

# ConfirmStartPrinting
source: Automatic Ink Test on status, make sure you start printing?
chs: 自动墨水测试功能开启状态,确认开始打印嘛?
cht: 自動墨水測試功能開啟狀態，確認開始列印嘛？

# EnterCorrectValue
source: Please enter the correct value
chs: 请输入正确的数值
cht: 請輸入正確的數值

# EnterTargetValue
source: Please enter target barometric valu
chs: 请输入目标气压值
cht: 請輸入目標氣壓值

source: Export Failed！
chs: 导出失败！
cht: 導出失敗！

source: Export Success！
chs: 导出成功！
cht: 導出成功！

source: File does not Exist!
chs: 文件不存在！
cht: 檔案不存在！

# GetDirtyCmdFialed
source: GetDirtyCmd fialed! cmd={0}
chs: 获取失败! 命令字={0}
cht: 獲取失敗! 命令字={0}

source: Get Ep6 Pipe Data fail!
chs: 获取EP6管道数据失败！
cht: 獲取EP6筦道數據失敗！

source: Get gray map fialed!
chs: 获取灰度映射失败！
cht: 獲取灰度映射失敗！

source: Get HapondPrintParam Failed
chs: 获取Hapond打印参数失败！
cht: 獲取Hapond列印參數失敗！

source: Get QR Code Failed!
chs: 获取QR码失败！
cht: 獲取QR碼失敗！

# Getwaveformfailed
source: Get waveform faile!
chs: 获取波形失败!
cht: 獲取波形失敗！

source: Get Y home position fialed!
chs: 获取Y位置失败！
cht: 獲取Y位置失敗！

source: High External Pressure|
chs: 外部气压过高|
cht: 外部氣壓過高|

# InputEmpty
source: Input can't be empty.
chs: 输入不能为空！
cht: 輸入不能為空！

source: input error !
chs: 输入错误！
cht: 輸入錯誤！

# IPEmpty
source: IP address cannot be empty!
chs: IP地址不能为空!
cht: IP地址不能為空！

source: Load JobConfig Error:
chs: 加载JobConfig错误：
cht: 加載JobConfig錯誤：

source: Low External Pressure|
chs: 外部气压过低|
cht: 外部氣壓過低|

# ModeExist
source: This Mode does exist!
chs: 方式已存在！
cht: 方式已存在！

source: Nozzle parameters read successfully!
chs: 喷嘴参数已成功读取！
cht: 噴嘴參數已成功讀取！

# OpenUV
source: Please Open the UV light after 10 min.
chs: 请在10分钟后打开紫外线灯。
cht: 請在10分鐘後打開紫外線燈。

source: Please select dotbit!
chs: 请选择dotbit！
cht: 請選擇dotbit！

# PowerOffMachine
source: Do you want to power off the machine?
chs: 你想关掉机器吗？
cht: 你想關掉機器麼？

source: Print record not found
chs: 没有查到打印记录
cht: 沒有查到列印記錄

source: Print switch has been turned off!
chs: 打印开关已经被关闭!
cht: 打印開關已經被關閉！

source: Read Error！
chs: 读取失败!
cht: 讀取失敗！

source: Read file error!
chs: 读取文件错误！
cht: 讀取文件錯誤!

# ReadingWait
source: Reading, please wait until the current read is complete and try again.
chs: 读取中，请等到当前读取完成后再试一次。
cht: 讀取中，請等到當前讀取完成後再試一次。

source: Safety Cylinder 1 Feed Ink|
chs: 安全气瓶1进墨水|
cht: 安全氣瓶1進墨水|

source: Safety Cylinder 2 Feed Ink|
chs: 安全气瓶2进墨水|
cht: 安全氣瓶2進墨水|

source: Save Failed！
chs: 保存失败！
cht: 保存失敗！

source: Save JobConfig Error:
chs: 保存JobConfig错误：
cht: 保存JobConfig錯誤:

source: Save JobMediaModes Error:
chs: 保存JobMediaModes错误：
cht: 保存JobMediaModes錯誤:

# SendCmdError
source: Send commond error!
chs: 发送指令失败！
cht: 發送指令失敗!

source: Set 1024 gray map fialed!
chs: 设置1024灰度映射失败！
cht: 設定1024灰度映射失敗！

source: Set Failed!
chs: 设置失败！
cht: 設置失敗！

source: Set gray map fialed!
chs: 设置灰度映射失败！
cht: 設定灰度映射失敗！

source: Set gray map success!
chs: 设置灰度映射成功！
cht: 設定灰度映射成功！

# SetMBIDFailed
source: Failed to set mainboard ID
chs: 设置主板ID失败！
cht: 設置主板ID失敗！

# SetMBIDSuccess
source: Set the mainboard ID success
chs: 设置主板ID成功！
cht: 設置主板ID成功！

source: Set Success!
chs: 设置成功！
cht: 設置成功！

source: Set Xaar382 Mode fialed!
chs: 设置Xaar 382模式失败！
cht: 設定xaar 382模式失敗！

source: Statistical failure!
chs: 统计失败！
cht: 統計失敗！

# SwitchInkTypeError
source: SwitchInkType Error!cmd {0},index {1}
chs: 切换墨水类型失败!cmd {0},index {1}
cht: 切換墨水類型失敗!cmd {0},index {1}

source: The selected value cannot be empty.
chs: 选定的值不能为空。
cht: 選定的值不能為空。

source: time out!
chs: 超时
cht: 超時

# UpdatePrinterSettingError
source: UpdatePrinterSetting SwitchInkType Error!cmd {0}
chs: 更新打印设置失败!cmd {0}
cht: 更新打印設置失敗!cmd {0}

source: wavefrom file error!
chs: 波形文件错误！
cht: 波形檔案錯誤！

source: White Negative Pressure Error|
chs: 白色负压出错|
cht: 白色負壓出錯|

# WriteHeadboardSucessed
source: Write Headboard has Sucessed!
chs: 写头板已经成功了！
cht: 寫頭板已經成功了！

# zMaxLengthZero
source: zMaxLength is Zero
chs: Z最大长度为零
cht: Z最大長度為零

# FactoryTool_labChange
source: Delta：{0}(pulse)
chs: 变化值：{0}脉冲

# FactoryTool_PossionX
source: X position:{0}(pulse)
chs: X轴 当前位置：{0}脉冲

# FactoryTool_PossionY
source: Y position:{0}(pulse)
chs: Y轴 当前位置：{0}脉冲

# FactoryTool_PossionY2
source: Y2 position:{0}(pulse)
chs: Y2轴 当前位置：{0}脉冲

# FactoryTool_PossionZ
source: Z position:{0}(pulse)
chs: Z轴 当前位置：{0}脉冲

# LayoutUpdateSuccess
source: Layout update successfully, restart the PM.
chs: 布局升级完成，请重启PM
cht: 佈局包升級完成，請重啟PM

# HapondIoMsg_RollUp
source: Rubber Roll is Up!
chs: 胶辊已升起!

# HapondIoMsg_CheckPressInk
source: Please check press ink unit!
chs: 请检查压墨推拉盖!

# HapondIoMsg_OpenCooling
source: Please open cooling unit!
chs: 请打开水冷机!

# HorizontalCalibrationMode_GroupQuick
source: GroupQuick
chs: 组内快速校准
cht: 组内快速校準

# HorizontalCalibrationMode_GroupColor
source: GroupColor
chs: 组内颜色校准
cht: 组内顏色校準

# HorizontalCalibrationMode_GroupFull
source: GroupAllCalibration
chs: 组内全校准
cht: 组内全校準

source: Cancel Moisturizing
chs: 取消保湿
cht: 取消保濕

source: Moisturize
chs: 保湿
cht: 保濕

# ParamterRatio
source: Paramter
chs: 参数
cht: 參數

source: HeadParamter
chs: 喷头参数
cht: 噴頭參數

source: Enable
chs: 启用
cht: 啟用

source: Source
chs: 数据源
cht: 數據源

source: DataType
chs: 数据类型
cht: 數據類型

# Confirm_DeleteLayout
source: Do you want to remove layout：{0} ?
chs: 是否删除布局：{0} ?
cht: 是否刪除佈局：{0} ?

# CloseColorNozzleModelEnum_Advanced
source: Advanced
chs: 高级
cht: 高級

# CloseColorNozzleModelEnum_Easy
source: Easy
chs: 简单
cht: 簡單

# CloseColorNozzleModelEnum_Feather
source: Feather
chs: 羽化
cht: 羽化

# CloseColorNozzle_DownCloseNozzle
source: LowerCloseNumber
chs: 下关闭喷嘴数
cht: 下關閉噴嘴數

# CloseColorNozzle_DownPercent
source: LowerSamplingPercentage
chs: 下抽点百分比
cht: 下抽點百分比

# CloseColorNozzle_OverLapNozzle
source: OverLapNozzle
chs: 重叠喷嘴数
cht: 重疊噴嘴數

# CloseColorNozzle_UpCloseNozzle
source: UpperCloseNumber
chs: 上关闭喷嘴数
cht: 上關閉噴嘴數

# CloseColorNozzle_UpPercent
source: UpperSamplingPercentage
chs: 上抽点百分比
cht: 上抽點百分比

# StrMakesureMediaReady
source: Please make sure the media is ready.
chs: 请确认介质已准备就绪.
cht: 請確認介質已準備就緒.

# ColseNozzle_AlreadyExists
source: Already exists in the list.
chs: 在列表中已经存在
cht: 在列表中已經存在

# ColseNozzle_ClearAll_Question
source: Do you want to clear the list of all the data?
chs: 是否要清空列表中全部数据？
cht: 是否要清空列表中全部数据？

# EncryptDog_MisBoardId
source: The headkey and the board ID do not match
chs: 加密锁和板卡ID不匹配
cht: 加密鎖和板卡ID不匹配

# DispName_Pass
source: Pass
th: จำนวนซ้ำ

# JobListColumnHeader_Passes
source: Passes
th: จำนวนซ้ำ
