Repository: 6555355/Scan_yan1
Catalog: IntermediateControl/Setting/CombinedSettings.*.resx
Languages: chs, th

# m_ButtonToBoard.Text
source: &ApplyToBoard
chs: &应用到主板
th: จ่ายให้กับแผงวงจร

# m_ButtonRefresh.Text
source: &Refresh
chs: 更新
th: ดาวน์โหลดไฟล์หรือหน้าเว็บให้แสดงผลอีกครั้งหนึ่ง

# m_ButtonDefault.Text
source: &Default Value
chs: 默认值(&D)
th: ค่าที่กำหนดไว้ล่วงหน้า(&d)

# m_CheckBoxAutoRefresh.Text
source: Auto refresh
chs: 自动刷新
th: การดาวน์โหลดข้อมูลให้แสดงผลใหม่โดยอัตโนมัติ

# Column_SetTemp.HeaderText
source: Set Temp
chs: 设置温度
th: ตั้งอุณหภูมิ

# ColumnNozzleTemp.HeaderText
source: Nozzle Temp
chs: 喷头温度
th: อุณหภูมิหัวพ่น

# ColumnHeatingTemp.HeaderText
source: Heating Temp
chs: 加热器温度
th: อุณหภูมิกรให้ความร้อน

# ColumnVoltageAdjust.HeaderText
source: Voltage Adjust
chs: 矫正电压
th: ปรับแรงดันไฟฟ้า

# ColumnCurrentVoltage.HeaderText
source: Current Voltage
chs: 当前电压
th: แรงดันไฟฟ้าปัจจุบัน

# ColumnBaseVoltage.HeaderText
source: Base Voltage
chs: 基准电压
th: ค่าแรงดันไฟฟ้าของฐาน

# ColumnPulseWidth.HeaderText
source: Pulse Width
chs: 脉宽
th: ความกว้างพัลส์

# m_GroupBoxTemperature.Text
source: Temperature and Voltage
chs: 温度和电压
th: อุณหภูมิ และ แรงดันไฟฟ้า

# m_CheckBoxAutoJumpWhite.Text
source: Auto jump white
chs: 自动跳白
th: กระโดดข้ามสีขาวโดยอัตโนมัติ

# m_NumericUpDownSprayTimes.ToolTip
source: times
chs: 次
th: เวลา

# m_LabelJobSpace.Text
source: Job Space
chs: 作业间距
th: ที่ว่างของงาน

# m_LabelFeather.Text
source: Feather
chs: 羽化
th: ลักษณะสำคัญ

# m_LabelAutoSpray.Text
source: AutoSpray
chs: 自动闪喷
th: การพ่นโดยอัตโนมัติ

# m_CheckBoxMeasureBeforePrint.Text
source: Measure Before Print
chs: 打印前测量介质
th: วัดก่อนพิมพ์

# m_CheckBoxNormalType.Text
source: Normal
chs: 普通
th: ปกติ

# m_LabelWidth.Text
source: Width
chs: 宽度
th: ความกว้าง

# m_LabelHeight.Text
source: Height
chs: 纸长
th: ความสูง

# m_LabelStripeWidth.Text
source: Width
chs: 宽度
th: ความกว้าง

# m_ButtonMeasure.Text
source: Measure
chs: 测量
th: การวัด

# m_LabelMargin.Text
source: Margin
chs: 测量边距
th: ขอบ

# m_LabelStripeSpace.Text
source: Space
chs: 距离
th: ที่ว่าง

# m_LabelStripePos.Text
source: Placement
chs: 位置
th: สถานที่

# m_CheckBoxYContinue.Text
source: Y continue printing
chs: Y连续打印
th: ทำการพิมพ์ต่อในทิศทาง y

# m_CheckBoxMixedType.Text
source: Color Mixed
chs: 彩色重叠
th: สีที่ผสม

# m_LabelStepTime.Text
source: Step Time
chs: 跳白时间
th: เวลาของขั้น

# m_CheckBoxHeightWithImageType.Text
source: Height same with image
chs: 和图像同高
th: ความสูงเหมือนกับภาพ

# m_NumericUpDownStepTime.ToolTip
source: s
chs: 秒
th: วินาที

# m_LabelSprayTimes.Text
source: SprayTimes
chs: 闪喷次数
th: เวลาที่ใช้ในการพ่น

# m_NumericUpDownAutoSpray.ToolTip
source: pass
th: จำนวนซ้ำ

# m_NumericUpDownSprayCycle.ToolTip
source: ms
chs: 毫秒
th: เศษหนึ่งส่วนพันวินาที

# m_LabelSprayCycle.Text
source: SprayPeriod
chs: 闪喷周期
th: ช่วงการพ่น

# m_CheckBoxIdleSpray.Text
source: Idle Spray
chs: 空闲闪喷
th: การพ่นอยู่เฉยๆ

# m_Label1.Text
source: Thickness
chs: 厚度
th: ความหนา

# m_CheckBoxKillBidir.Text
source: Stable color order
chs: 固定色序
th: ลำดับสีคงที่

# m_CheckBoxAutoYCalibrate.Text
source: Y-Encoder length calibration
chs: 码盘总长控制
th: เครื่องเข้ารหัสทิศทาง y คำนวณความยาว

# m_NumericUpDownPTASpraying.ToolTip
source: ms
th: เศษหนึ่งส่วนพันวินาที

# m_NumericUpDownAutoClean.ToolTip
source: pass
th: จำนวนซ้ำ

# m_NumericUpDownCleanTimes.ToolTip
source: times
chs: 次
th: เวลา

# m_NumericUpDownPTACleaning.ToolTip
source: ms
th: เศษหนึ่งส่วนพันวินาที

# m_LabelZSpace.Text
source: Z space
chs: Z 间距
th: ช่องว่าง z

# m_ButtonZAuto.Text
source: ZAuto
chs: Z 自动
th: อัตโนมัติ z

# m_ButtonZManual.Text
source: ZManual
chs: Z 手工
th: ด้วยมือ z

# labelWhiteInk.Text
source: White Ink:
chs: 白墨:
th: น้ำหมึกสีขาว:

# m_LabelAutoClean.Text
source: AutoClean
chs: 自动清洗
th: ทำความสะอาดโดยอัตโนมัติ

# m_labelPrintPrespraytime.Text
source: Print Pre-spray Time
chs: 印前闪喷持续时间
th: เวลาก่อนการพ่นในการพิมพ์

# m_CheckBoxSprayBeforePrint.Text
source: Spray Before Print
chs: 打印前闪喷
th: พ่นก่อนพิมพ์

# m_LabelCleanTimes.Text
source: CleanTimes
chs: 清洗次数
th: เวลาที่ใช้ทำความสะอาด

# m_labelPauseTimeAfterCleaning.Text
source: PauseTimeAfterCleaning
chs: 清洗后停顿时间
th: เวลาที่หยุดชั่วคราวหลังการทำความสะอาด

# m_labelLang.Text
source: Language:
chs: 语言:
th: ภาษา:

# m_labelUnit.Text
source: Unit:
chs: 单位:
th: หน่วย:

# buttonApply.Text
source: Apply
chs: 应用
th: จ่ายให้
