Repository: 6555355/Scan_yan1
Catalog: BYHXPrinterManager/Main/MainForm.*.resx
Languages: th

# m_MenuItemTools.Text
source: &Tools
th: เครื่องมือ(&t)

# m_MenuItemAdd.Text
source: &Add Job
th: เพิ่มงาน(&a)

# m_MenuItemEdit.Text
source: &Edit
th: แก้ไข(&e)

# m_MenuItemAbout.Text
source: &About
th: ดูรายละเอียดของโปรแกรม(&a)

# m_ToolBarButtonMeasurePaper.ToolTipText
source: Measure paper width
th: การวัดความกว้างกระดาษ

# m_ToolBarButtonPrint.ToolTipText
source: Print job
th: งานพิมพ์

# m_ToolBarButtonCheckNozzle.ToolTipText
source: Check nozzle
th: ตรวจดูหัวพ่น

# m_MenuItemSetting.Text
source: &Setting
th: การตั้งค่า(&s)

# m_MenuItemFactoryDebug.Text
source: FactoryDebug
th: ข้อบกพร่องของโรงงาน

# m_ToolBarButtonDownZ.ToolTipText
source: Z Move Down
th: เคลื่อนลงข้างล่าง

# m_StatusBarPanelError.ToolTipText
source: Error Code
th: รหัสบกพร่อง

# m_MenuItemView.Text
source: &View
th: มองดู(&v)

# menuItemDongle.Text
source: Dongle
th: ดองเกิ้ล

# m_MenuItemDemoPage.Text
source: &DemoPage
th: หน้ากระดาษสาธิต(&d)

# m_MenuItemUpdate.Text
source: &Update
th: ปรับปรุงให้ทันสมัย(&u)

# m_ToolBarButtonGoHome.ToolTipText
source: Move carriage to origin
th: เคลื่อนที่ชุดหัวพิมพ์ไปยังจุดดั้งเดิม

# m_MenuItemHelp.Text
source: &Help
th: ตัวช่วย(&h)

# m_ToolBarButtonDelete.ToolTipText
source: Delete job
th: ลบงานทิ้ง

# m_MenuItemRealTime.Text
source: &Real Setting
th: การตั้งค่าจริง(&r)

# m_ToolBarButtonSingleClean.ToolTipText
source: Single head clean
th: ล้างหัวพิมพ์เดียว

# m_MenuItemExit.Text
source: E&xit
th: ออก

# m_MenuItemCalibraion.Text
source: &Calibration Wizard
th: ขั้นตอนการคำนวณสำเร็จรูป(&c)

# m_MenuItemSaveToPrinter.Text
source: Save &To Printer
th: （&t）บันทึกไปยังเครื่องพิมพ์

# m_ToolBarButtonBackward.ToolTipText
source: Move backward
th: เคลื่อนที่ถอยกลับ

# m_MenuItemLoadFromPrinter.Text
source: Load &From Printer
th: （&f）อ่านข้อมูลจากเครื่องพิมพ์

# m_MenuItemPrint.Text
source: &Print Job
th: พิมพ์งาน(&p)

# m_ToolBarButtonForward.ToolTipText
source: Move forward
th: เคลื่อนที่ไปข้างหน้า

# m_ToolBarButtonGoHomeY.ToolTipText
source: Move carriage to origin Y
th: เคลื่อนที่ชุดหัวพิมพ์ไปยังจุดดั้งเดิม y

# m_ToolBarButtonSetOrigin.ToolTipText
source: Set print origin
th: ตั้งจุดดั้งเดิมการพิมพ์

# m_MenuItemHWSetting.Text
source: &HW Setting
th: ตั้งค่าฮาร์ดแวร์(&h)

# m_MenuItemLeftRight.Text
source: &Wide Screen
th: จอภาพแบบกว้าง(&w)

# m_ToolBarButtonSpray.ToolTipText
source: Spray
th: พ่น

# m_ToolBarButtonAdd.ToolTipText
source: Add job
th: เพิ่มงาน

# m_MenuItemDebug.Text
source: Debug
th: สถานการณ์ตรวจสอบจุดบกพร่องและทำการแก้ไข

# m_ToolBarButtonSetOriginY.ToolTipText
source: Set print origin Y
th: ตั้งจุดดั้งเดิมการพิมพ์ y

# m_ToolBarButtonPauseResume.ToolTipText
source: Pause or resume
th: หยุดชั่วคราวหรือกลับมาทำงานใหม่

# m_ToolBarButtonGoHomeZ.ToolTipText
source: Move carriage to origin Z
th: เคลื่อนที่ชุดหัวพิมพ์ไปยังจุดดั้งเดิม z

# m_MenuItemUVSetting.Text
source: &UV Setting
th: การตั้งค่าแสงยูวี(&u)

# m_ToolBarButtonAutoClean.ToolTipText
source: Auto clean
th: ทำความสะอาดโดยอัตโนมัติ

# m_ToolBarButtonRight.ToolTipText
source: Move right
th: เคลื่อนไปทางขวา

# m_MenuItemSave.Text
source: &Save
th: บันทึก(&s)

# m_ToolBarButtonStop.ToolTipText
source: Stop
th: หยุด

# m_StatusBarPanelPercent.ToolTipText
source: Percentage
th: สั่นส่วนเปอร์เซ็นต์

# m_ToolBarButtonEdit.ToolTipText
source: Edit job
th: แก้ไขงาน

# m_StatusBarPanelJetStaus.Text
source: Idle
th: อยู่เฉยๆ

# m_StatusBarPanelJetStaus.ToolTipText
source: Status
th: สถานะ

# m_ToolBarButtonAbort.ToolTipText
source: Abort job
th: หยุดทำงาน

# m_MenuItemPassword.Text
source: &Password
th: รหัสผ่าน(&p)

# m_MenuItemDelete.Text
source: &Delete Job
th: ลบงานทิ้ง(&d)

# m_MenuItemJob.Text
source: &Job
th: งาน(&j)

# m_ToolBarButtonLeft.ToolTipText
source: Move left
th: เคลื่อนไปทางซ้าย

# m_ToolBarButtonUpZ.ToolTipText
source: Z Move Up
th: เคลื่อนที่ขึ้นข้างบน

# m_MenuItemTopDown.Text
source: &Normal
th: ปกติ(&n)

# menuItemDongleKey.Text
source: Dongle Key
th: กุญแจดองเกิ้ล
