Repository: 6555355/Scan_yan1
Catalog: ErrRes/ErrRes.*-*.resx
Languages: chs, cht, th

# CoreBoard_Err_INTERNAL_MOVING_TIMEOUT
source: Movement overtime.
chs: 运动命令发出30秒后，没有收到运动完成命令.
cht: 運動命令發出30秒後，沒有收到運動完成命令.
th: การเคลื่อนที่เกินเวลา.

# CoreBoard_Err_INTERNAL_WRONGAUTOCLEAN
source: wrong AUTOCLEAN command.
chs: 错误的AUTOCLEAN命令.
cht: 錯誤的AUTOCLEAN命令.
th: คำสั่งทำความสะอาดอัตโนมัติผิดพลาด.

# CoreBoard_Err_INTERNAL_WRONGBANDINFO
source: wrong AUTOCLEAN command.
chs: 错误的AUTOCLEAN命令.
cht: 錯誤的AUTOCLEAN命令.
th: คำสั่งทำความสะอาดอัตโนมัติผิดพลาด.

# CoreBoard_Err_INTERNAL_DEBUG1
source: Debug status 1.
chs: 调试状态 1.
cht: 調試狀態 1.

# CoreBoard_Err_INTERNAL_DEBUG2
source: Debug status 2.
chs: 调试状态2.
cht: 調試狀態2.

# CoreBoard_Fatal_INTERNAL_SW1
source: Internal error, blank band and y-distance is zero.
chs: 内部错误,空白Band或Y向距离为零.
cht: 內部錯誤,空白Band或Y向距離為零.
th: ข้อบกพร่องภายใน, แถบเปล่า และระยะทาง y เป็นศูนย์.

# CoreBoard_Fatal_INTERNAL_WRONGPINCONF
source: PINCONF writing FPGA errors.
chs: PINCONF写入FPGA错误.
cht: PINCONF寫入FPGA錯誤.
th: ข้อผิดพลาดจาก pinconf เขียนไปที่ FPGA.

# CoreBoard_Fatal_FACTORY_COLORNUM_WRONG
source: Factory Set the number of colors in wrong.
chs: 工厂设置中写入的颜色数错误.
cht: 工廠設置中寫入的顏色數錯誤.
th: หมายเลขของสีต่างๆที่ตั้งจากโรงงานไม่ถูกต้อง.

# CoreBoard_Fatal_HB_EEPROM_WRT_ERR
source: Headboard EEPROM writing failure.
chs: 头板的EEPROM写入失败.
cht: 頭板的EEPROM寫入失敗.
th: การเขียนลงบน eeprom ของแผงหัวพิมพ์ล้มเหลว.

# CoreBoard_Service_SDRAM_CHECK
source: SDRAM didn't pass Check.
chs: SDRAM校验没有通过.
cht: SDRAM校驗沒有通過.
th: Sdram ไม่ผ่านการตรวจ.

# CoreBoard_Warning_PUMP_SPOTCOLOR1
source: Pumping spot color 1.
chs: 专色1正在泵墨.
cht: 專色1正在泵墨.
th: การปั้มจุดสี 1.

# CoreBoard_Warning_PUMP_SPOTCOLOR2
source: Pumping spot color 2.
chs: 专色2正在泵墨.
cht: 專色2正在泵墨.
th: การปั้มจุดสี 2.

# CoreBoard_Fatal_HB_OVERHEAT
source: Nozzle overheating, all the heater was closed.
chs: 喷头过热，所有加热被强行关闭。
cht: 噴頭過熱，所有加熱器被強行關閉。
th: ร้อนหัว, ฮีตเตอร์ทุกตัวถูกปิด.

# CoreBoard_Fatal_SHAKEHAND_ERR
source: version of the software error or an error, not through the handshake protocol.
chs: 软件错误或者版本错误，没有通过握手协议。
cht: 軟體錯誤或者版本錯誤，沒有通過握手協定。

# CoreBoard_Fatal_SWVERSION_ERR
source: firmware version requires special software, version error.
chs: 固件要求特殊的软件版本，版本错误。
cht: 固件要求特殊的軟體版本，版本錯誤。

# CoreBoard_Fatal_NOT_SUPPORT_2C_SHARE_1H
source: Current systems do not support one head of two colors.
chs: 当前系统设置不支持一头两色。
cht: 當前系統設置不支援一頭兩色。

# CoreBoard_Warning_INK_PASSWORD_WRONGINPUT
source: input password is incorrect, with non-0 ~ F value.
chs: 输入墨水密码错误，含有非0~F的值.
cht: 輸入墨水密碼錯誤，含有非0~F的值.

# CoreBoard_Warning_INK_PASSWORD_WRONG
source: not a legitimate ink password.
chs: 不是一个合法墨水密码.
cht: 不是一個合法墨水密碼.

# CoreBoard_Warning_INK_PASSWORD_MANUFACTURERIDNOTMATCH
source: ink password and vendors do not match.
chs: 墨水密码和厂商不匹配.
cht: 墨水密碼和廠商不匹配.

# CoreBoard_Warning_INK_PASSWORD_BOARDIDNOTMATCH
source: ink password and the board did not match.
chs: 墨水密码和板子不匹配.
cht: 墨水密碼和板子不匹配.

# CoreBoard_Warning_LIMITEDINK_FIRST
source: reoccupy 10 liters beyond the ink limit the first warning.
chs: 再用10升就超出墨水限制了，第一次警告.
cht: 再用10升就超出墨水限制了，第一次警告.

# CoreBoard_Warning_LIMITEDINK_SECOND
source: reoccupy 5 litre beyond the ink limit the second warning.
chs: 再用5升就超出墨水限制了，第二次警告.
cht: 再用5升就超出墨水限制了，第二次警告.

# CoreBoard_Warning_LIMITEDINK_LAST
source: reoccupy liter is beyond the limits, the last warning.
chs: 再用1升就超出墨水限制了，最后一次警告.
cht: 再用1升就超出墨水限制了，最後一次警告.

# CoreBoard_Warning_INK_PASSWORD_UNKNOWN_DOT_VOLUME
source: nozzle is not currently supported ink passwords.
chs: 当前喷头不支持墨水密码功能.
cht: 當前噴頭不支持墨水密碼功能.

# CoreBoard_Fatal_LIMITEDINK_RUNOUT
source: over the ink amount limitation, please enter a new password.
chs: 超过墨水用量限制，请重新输入口令.
cht: 超過墨水用量限制，請重新輸入口令.

# CoreBoard_Fatal_SWVERSION_ERR_INK_PWD
source: Firmware required software to support the ink password, version error.
chs: 固件要求软件版本支持墨水密码，版本错误.
cht: 固件要求軟件版本支持墨水密碼，版本錯誤.

# CoreBoard_Updating_GZ_ILIGALFILE
source: Need special Firmware
chs: 需要特别固件。
cht: 需要特別固件。

# CoreBoard_Updating_INKP_ILIGALFILE
source: Need special ink password Firmware
chs: 需要特殊墨水密码固件。
cht: 需要特殊墨水密碼固件。

# CoreBoard_Updating_UPDATEERR_16H_ILIGALFILE
source: 8head Hardware can't update 16H Firmware
chs: 8头硬件无法升级16头的固件。
cht: 8頭硬件無法升級16頭的固件。

# CoreBoard_Warning_FPGA_LESSDATA
source: Print data is less than fire number or empty when trigger
chs: 打印数据小于点火数.
cht: 打印數據小于點火數.

# CoreBoard_Warning_FPGA_ULTRADATA
source: Print data is more than fire number
chs: 打印数据多于点火数.
cht: 打印數據多于點火數.

# CoreBoard_Service_FLASH
source: Flash. Cann't read FPGA from flash.
chs: 无法从Falsh读取FPGA.
cht: 無法從Falsh讀取FPGA.

# CoreBoard_Fatal_SECURITY_CHIP_ERR
source: Write board id Error?
chs: 读板子ID错误。
cht: 寫板子ID錯誤。

# CoreBoard_Service_SDRAM_NOMATCH
source: SDRAM is too small to support the current settings.
chs: SDRAM 太小，不能支持当前的设置。
cht: SDRAM是太小，無法支持當前的設置

# CoreBoard_Service_READBOARDID_FAIL
source: Read board id Error.
chs: 读板子ID错误。
cht: 讀板子ID錯誤。

# CoreBoard_Updating_PCDATA_ERR
source: The data format is wrong.
chs: 发送的数据错误.
cht: 發送的數據錯誤.

# CoreBoard_Updating_NO_HEADNUM
source: The nozzle number does not exist.
chs: 发送的喷头号不存在.
cht: 發送的噴頭號不存在.

# CoreBoard_Updating_HBDATA_ERR
source: The mainboard sending Headboard data error.
chs: 主板发送到头板数据错误.
cht: 主板發送到頭板數據錯誤.

# CoreBoard_Updating_PRHD_SETERR
source: Headboard setting nozzle failure.
chs: 头板设置喷头失败.
cht: 頭板設置噴頭失敗.

# CoreBoard_Err_CURVE_EXCEEDSIZE
source: Send the temperature of the rated voltage curve data exceeds size range.
chs: 发送的温度电压曲线数据大小超过额定范围.
cht: 發送的溫度電壓曲線數據大小超過額定範圍.

# CoreBoard_Err_CURVE_PCSND_DATA
source: The data format is wrong.
chs: 发送的数据错误.
cht: 發送的數據錯誤.

# CoreBoard_Err_CURVE_SAVE_ROM
source: The mainboard data storage to eeprom failure.
chs: 主板数据存储到eeprom失败.
cht: 主板數據存儲到eeprom失敗.

# CoreBoard_Err_CURVE_NO_SPACE
source: The mainboard eeprom don't have enough space for storage new receiving data.
chs: 主板eeprom没有足够空间存储新接收的数据.
cht: 主板eeprom沒有足夠空間存儲新接收的數據.

# CoreBoard_Err_CURVE_UNKN_HDNUM
source: Send nozzle number does not exist.
chs: 发送的喷头号不存在.
cht: 發送的噴頭號不存在.

# CoreBoard_Err_CURVE_MAP
source: The mainboard eeprom curve data is mapped into memory error.
chs: 主板eeprom曲线数据映射到内存错误.
cht: 主板eeprom曲線數據映射到內存錯誤.

# CoreBoard_Err_CURVE_READ_ROM
source: Read the mainboard eeprom failure.
chs: 主板读取eeprom失败.
cht: 主板讀取eeprom失敗.

# CoreBoard_Err_CURVE_ROM_CHKSUM
source: Curve data checksum validation error .
chs: 曲线数据checksum校验错误.
cht: 曲線數據checksum校驗錯誤.

# CoreBoard_Err_HB_NOSUPPORT_FUNC
source: Headboard type does not support this feature.
chs: 头板类型不支持此功能.
cht: 頭板類型不支持此功能.

# CoreBoard_Warning_EPSONHEAD_TEMP_TOO_LOW
source: Head temperature too low.
chs: 头温度太低。
cht: 頭溫度太低。

# CoreBoard_Warning_EPSONHEAD_TEMP_TOO_HIGH
source: Head temperature too high.
chs: 头温度过高。
cht: 頭溫度過高。

# CoreBoard_Warning_EPSONHEAD_NOT_CONNECT
source: Print head is not connected.
chs: 打印头未连接。
cht: 打印頭未連接。

# CoreBoard_Warning_EPSON_FPGA_ULTRADATA
source: core board FPGA report data too more.
chs: 核心板FPGA报告数据太多。
cht: 核心板FPGA報告數據太多。

# CoreBoard_Warning_EPSON_FPGA_LESSDATA
source: core board FPGA report data too less.
chs: 核心板FPGA报告数据太少。
cht: 核心板FPGA報告數據太少。

# CoreBoard_Warning_UNKNOWN_NOZZLE_COUNT
source: Unknown number of the current head of the nozzle.
chs: 当前的喷嘴数目未知。
cht: 當前的噴嘴數目未知。

# CoreBoard_Fatal_EPSON_HEAD_BAD
source: Print head error.
chs: 打印头错误。
cht: 打印頭錯誤。

# CoreBoard_Fatal_EPSON_HEAD_FPGA_ERR
source: head board FPGA error.
chs: 头板FPGA错误。
cht: 頭板FPGA錯誤。

# CoreBoard_Fatal_T_JET_PASSNUM_ERR
source: t-jet pass number error.
chs: T-jet通道数错误。
cht: T-jet通道數錯誤。

# EnumCmdSrc_FX2_Warning_PUMP_STOP
source: Because more than 4 seconds the signal had not received the ink bottle, so turn off all the ink pump.
chs: 因为超过4秒没有收到墨瓶信号，所以关闭所有墨泵。
cht: 因為超過4秒沒有收到墨瓶信號，所以關閉所有墨泵。

# EnumCmdSrc_FX2_Warning_SETFPGA_HDTYPE
source: set fpga 8heads or 16heads failed.
chs: 设置 fpga 8头或16头失败。
cht: 設置 fpga 8頭或16頭失敗。

# EnumCmdSrc_FX2_Service_UART1_TXTIMEOUT
source: Motion COM timeout.
chs: 运动通讯超时。
cht: 運動通訊超時。

# EnumCmdSrc_FX2_Service_ENTERSLEEP
source: Device into a sleep state
chs: 设备进入了睡眠状态，这个不应该发生。
cht: 設備進入了睡眠狀態，這個不應該發生。

# EnumCmdSrc_FX2_Service_DEBUG
source: Debug error.
chs: 调试错误。
cht: 調試錯誤。

# COMCommand_Abort_InternalErr_2
source: Internal Error 2.
chs: 内部错误2.
cht: 內部錯誤2.

# COMCommand_Abort_InternalErr_1
source: Internal error 1.
chs: 内部错误1.
cht: 內部錯誤1.

# COMCommand_Abort_OverTemp_Protect
source: Temperature overload protection.
chs: 温度过高保护.
cht: 溫度過高保護.

# COMCommand_Abort_OverCurrent_Protect
source: Current overload protection.
chs: 电流过载保护.
cht: 電流過載保護.

# CoreBoard_Updating_TRY_AGAIN
source: Please upgrade again.
chs: 请再次升级.
cht: 請再次升級.

# CoreBoard_Warning_EPSON_DRIVER_OVERHEAT
source: Print head drive over heat.
chs: 打印头驱动温度过高.
cht: 打印頭驅動溫度過高.

# CoreBoard_Warning_EPSON_XHOT_ERROR
source: Print head over heat.
chs: 打印头温度过高.
cht: 打印頭溫度過高.

# CoreBoard_Service_ARM_MOTION
source: ARM Motion system initialization error..
chs: ARM运动初始化错误.
cht: ARM運動初始化錯誤.

# CoreBoard_Service_HEADBOARD_INIT_FAIL
source: Head board failed to initialize.
chs: 头板初始化失败.
cht: 頭板初始化失敗.

# CoreBoard_Fatal_CALIBRATION_DATA
source: Factory initialization settings wrong.
chs: 出厂初始化设置出错。
cht: 出廠初始化設置出錯。

# CoreBoard_Err_PUMPINKTIMEOUT
source: Pump ink overtime.
chs: 泵墨超时.
cht: 泵墨超時.

# CoreBoard_Service_HEADBOARD_NO_FW
source: Have a head board but no legal Firmware.
chs: 有头板没有合法的Firmware.
cht: 有頭板沒有合法的Firmware.

# CoreBoard_Fatal_HEADBOARD_CONFIG
source: Head board is not configured properly.
chs: 头板配置不正确.
cht: 頭板配置不正確.

# CoreBoard_Err_CAN_COMM_TIMEOUT
source: CAN communication error, send timeput.
chs: CAN通讯错误，发送超时.
cht: CAN通訊錯誤，發送超時.

# CoreBoard_Err_CAN_COMM_ERROR
source: CAN communication error, error counter overrun.
chs: CAN通讯错误，错误计数器超限.
cht: CAN通訊錯誤，錯誤計數器超限.

# CoreBoard_Err_CAN_BUFFER_ERROR
source: CAN communication error, reorganizing the buffer mistakes.
chs: CAN通讯错误，重组缓冲区错误.
cht: CAN通訊錯誤，重組緩衝區錯誤.

# CoreBoard_Err_CAN_CONTROLLER_ERROR
source: CAN controller errors.
chs: CAN控制器错误.
cht: CAN控制器錯誤.

# CoreBoard_Fatal_NO_TEMPERATURE_SENSOR
source: Can not detect temperature sensor.
chs: 检测不到温度传感器.
cht: 檢測不到溫度傳感器.

# CoreBoard_Fatal_INK_SPILL
source: Negative pressure ink cartridge deposition.
chs: 负压墨盒淤墨.
cht: 負壓墨盒淤墨.

# CoreBoard_Fatal_INK_SUPPLY_LOW
source: Ink cartridge for lack of ink.
chs: 供墨墨盒缺墨.
cht: 供墨墨盒缺墨.

# CoreBoard_Warning_INK_SUPPLY_SLOW
source: Continuous pump more than 10 seconds ink.
chs: 连续供墨超过10秒.
cht: 連續供墨超過10秒.

# CoreBoard_Service_HB_OPRATION_EEPROM_FAIL
source: HeadBoard operation eeprom failure .
chs: 头板操作eeprom失败.
cht: 頭板操作eeprom失敗.

# CoreBoard_Service_HB_FPGA_ERROR
source: HeadBoard FPGA error .
chs: 头板FPGA错误.
cht: 頭板FPGA錯誤.

# CoreBoard_Err_HEAD_OFFSET
source: Head distance to the electric eye set incorrectly.
chs: 喷头到电眼距离设定错误.
cht: 噴頭到電眼距離設定錯誤.

# CoreBoard_Err_FPGA_INT
source: Exception notification the FPGA.
chs: FPGA产生了异常通知.
cht: FPGA産生了異常通知.

# CoreBoard_Err_NO_DMA_LLI
source: System-generated link list is too slow.
chs: 系统生成链表速度不够.
cht: 系統生成鏈表速度不夠.

# CoreBoard_Err_DMA_LLI_LEN
source: Linked lists need to go beyond the predefined.
chs: 链表需求超出程序定义.
cht: 鏈表需求超出程序定義.

# CoreBoard_Err_CADG_CTL_LINE_FAULT
source: Machine's lines erro.
chs: 机器控制线路故障.
cht: 機器控制線路故障.

# CoreBoard_Err_CADG_INIT_PLC
source: Plc init erro.
chs: 初始化plc硬件故障.
cht: 初始化PLC硬體故障.

# CoreBoard_Err_CADG_PRINT_FAULT
source: Printing erro.
chs: 打印故障.
cht: 打印故障.

# CoreBoard_Fatal_FUNC_BOARD_STARTUP
source: Functional Board started.
chs: 功能板启动.
cht: 功能板啓動.

# CoreBoard_Fatal_PRINT_DATA_ERROR
source: Print data is wrong or missing.
chs: 打印数据传输错误或丢失.
cht: 打印數據傳輸錯誤或丟失.

# CoreBoard_Fatal_FACTORY_DATA_ERROR
source: Factory settings data errors.
chs: 工厂设置数据错误.
cht: 工廠設置數據錯誤.

# COMCommand_Abort_RatioEEPROM
source: Difference between the measured value and the default value is too large.
chs: 测量值与默认值相差太大.
cht: 測量值與默認值相差太大.

# COMCommand_Abort_RatioMeasure
source: Difference between the measured value and the current value is too large.
chs: 测量值与当前值相差太大.
cht: 測量值與當前值相差太大.

# COMCommand_Abort_NoSupportCorrectRatio
source: Automatic measurement function is not supported.
chs: 不支持自动测量功能.
cht: 不支持自動測量功能.

# CoreBoard_Warning_SCORPION_WARNING
source: Printer has alarm.
chs: 打印机产生了告警.
cht: 打印機産生了告警.

# CoreBoard_Warning_HB_FW_VERSION
source: Upgrade Kit contains the FW version is too low for the headboard, is no longer supported.
chs: 升级包包含头板的FW版本太低，已不支持.
cht: 升級包包含頭板的FW版本太低，已不支持.

# CoreBoard_Warning_HB_FW_ID_ERROR
source: Head Board FW ID does not match the current header cannot upgrade the FW.
chs: 头板FW ID不匹配，当前头板不能升级该FW.
cht: 頭板FW ID不匹配，當前頭板不能升級該FW.

# CoreBoard_Warning_HB_FW_UPDATER
source: Error occurred during the upgrade.
chs: 头板升级过程发生错误.
cht: 頭板升級過程發生錯誤.

# CoreBoard_Warning_HBFPGA_FW_UPDATER
source: Head board FPGA upgrade process errors occurred.
chs: 头板FPGA升级过程发生错误.
cht: 頭板FPGA升級過程發生錯誤.

# CoreBoard_Warning_FUNC_FW_UPDATER
source: Functional Board error occurred during the upgrade.
chs: 功能板升级过程发生错误.
cht: 功能板升級過程發生錯誤.

# CoreBoard_Fatal_PANEL_EX_LOST
source: Auxiliary control panel failed to communicate.
chs: 辅助控制板通信失败.
cht: 輔助控制板通信失敗.

# CoreBoard_Fatal_PANEL_EX_BUSY
source: Auxiliary control panel is busy.
chs: 辅助控制板忙.
cht: 輔助控制板忙.

# CoreBoard_Warning_EPSON_HEAD_FPGA_ERR
source: Head board FPGA error.
chs: 头板FPGA错误.
cht: 頭板FPGA錯誤.

# CoreBoard_Warning_EPSON_HEAD_LVDS_ERR
source: Mainboard report LVDS lost lock.
chs: 主板报告LVDS失锁.
cht: 主板報告LVDS失鎖.

# CoreBoard_Warning_EPSON_HEAD_REPORT_LVDS_ERR
source: Head plate report LVDS lost lock.
chs: 头板报告LVDS失锁.
cht: 頭板報告LVDS失鎖.

# CoreBoard_Service_HB_WAVEFROM_Init_fail
source: WAVEFROM initialization configuration error.
chs: WAVEFROM初始化配置错误.
cht: WAVEFROM初始化配置錯誤.

# CoreBoard_Service_HB_WAVEFROM_Download_fail
source: WAVEFROM download error.
chs: WAVEFROM 下载错误.
cht: WAVEFROM 下載錯誤.

# CoreBoard_Fatal_UV_RUNOUT
source: UV time runout.
chs: UV灯时间用尽.
cht: UV燈時間用盡.

# CoreBoard_Warning_PASSWORD_WRONGINPUT
source: contain illegal word not in '0'-'f'.
chs: 输入选配密码错误,含有非0-f的值.
cht: 輸入選配密碼錯誤,含有非0-f的值.

# CoreBoard_Warning_PASSWORD_WRONG
source: password illegal.
chs: 不是一个合法的选配密码.
cht: 不是一個合法的選配密碼.

# CoreBoard_Warning_PASSWORD_MANUFACTURERIDNOTMATH
source: password no math firm.
chs: 选配密码和厂商不匹配.
cht: 選配密碼和廠商不匹配.

# CoreBoard_Warning_PASSWORD_BOARDIDNOTMATH
source: password no math mainboard.
chs: 选配密码和板子不匹配.
cht: 選配密碼和板子不匹配.

# CoreBoard_Warning_PASSWORD_FIRST
source: the first time UV runout.
chs: UV时间超时第一次报警.
cht: UV時間超時第一次報警.

# CoreBoard_Warning_PASSWORD_SECOND
source: the second time UV runout.
chs: UV时间超时第二次报警.
cht: UV時間超時第二次報警.

# CoreBoard_Warning_PASSWORD_LAST
source: the last time UV runout.
chs: UV时间超时最后一次报警.
cht: UV時間超時第三次報警.

# CoreBoard_Warning_TILE_IN_TILE
source: The electric eye spacing is too small , electric eye signals are discarded.
chs: 电眼间距太小，电眼信号被丢弃.
cht: 電眼間距太小，電眼信號被丟棄.

# CoreBoard_Warning_TILE_POS_FULL
source: Electric eye buffer is full , the electric eye signals are discarded.
chs: 电眼缓冲区已满, 电眼信号被丢弃.
cht: 電眼緩衝區已滿, 電眼信號被丟棄.

# CoreBoard_Warning_PASSED_TILE
source: Print data ready too late , the electric eye signals are discarded.
chs: 打印数据就绪的太迟 , 电眼信号被丢弃.
cht: 打印數據就緒的太遲 , 電眼信號被丟棄.

# CoreBoard_Warning_PUMPLONG_ALARM
source: Pump ink overtime.
chs: Pump ink overtime泵墨超时.
cht: 泵墨超時.

# CoreBoard_Fatal_HB_OVERCOOL
source: The nozzle temperature is too low (exceptions), heating control has been forced to close.
chs: 喷头温度过低（异常），加热控制被强行关闭.
cht: 噴頭溫度過低（異常），加熱控制被強行關閉.

# CoreBoard_Fatal_OVERCHANGE
source: The nozzle temperature changes too severe (exceptions), heating control has been forced to close.
chs: 喷头温度变化过于剧烈（异常），加热控制被强行关闭.
cht: 噴頭溫度變化過于劇烈（異常），加熱控制被強行關閉.

# CoreBoard_Err_PM_FEATURE_UNSUPPORTED
source: Software doesn't support variable temperature ratio, please pgrade the software.
chs: 软件不支持变温度倍率,请升级软件.
cht: 軟件不支持變溫度倍率,請升級軟件.

# CoreBoard_Err_PM_SCALE_NOT_MATCH
source: Software inconsistent temperature ratio, and the default rate, need to reconfigure the factory Settings.
chs: 软件温度倍率和预设倍率不一致,需重新配置工厂设置.
cht: 軟件溫度倍率和預設倍率不一致,需重新配置工廠設置.

# CoreBoard_Fatal_TEMP_RATIO_UNSUPPORT
source: Head board does not support the variable temperature ratio. Please upgrade the head plate.
chs: 头板不支持变温度倍率.请升级头板.
cht: 頭板不支持變溫度倍率.請升級頭板.

# COMCommand_Abort_OutOfPrintRang
source: Print position overrun, please try to print images or narrow width or increase printing the origin position.
chs: 打印位置超限,请尝试缩小打印图像幅宽或者增加打印原点位置.
cht: 打印位置超限,請嘗試縮小打印圖像幅寬或者增加打印原點位置.

# CoreBoard_Err_TargetTempLocked
source: Temperature control has not been unlocked.
chs: 温度控制尚未解除锁定.
cht: 溫度控制尚未解除鎖定.

# CoreBoard_Err_HIGH_VOL_TOO_LOW
source: Head board pressure is too low.
chs: 头板高压过低.
cht: 頭板高壓過低.

# CoreBoard_Err_WAVEFORM_INDEX
source: Waveform failed download.
chs: 波形下载失败.
cht: 波形下載失敗.

# CoreBoard_Err_WAVEFORM_CONFIG
source: Waveform configuration failed.
chs: 波形配置失败.
cht: 波形配置失敗.

# CoreBoard_Err_SET_VOLT_ERROR
source: Full/half pressure setting error.
chs: 全半压设置出错.
cht: 全半壓設置出錯.

# CoreBoard_Fatal_WAVEFORM_INVALID
source: No waveform identification effectively.
chs: 没有波形有效标识.
cht: 沒有波形有效標識.

# CoreBoard_Fatal_FULL_HALF_VOLT_ERROR
source: Half pressure is larger than total pressure.
chs: 半压大于全压.
cht: 半壓大于全壓.

# CoreBoard_Fatal_EEPROM_PARAM_UNVALID
source: Eeprom parameters is illegal, needs to be set.
chs: eeprom参数非法，需要重新设置.
cht: eeprom參數非法，需要重新設置.

# CoreBoard_Service_HBFW_ERROR
source: Head board FW and the board does not match, need to replace the head board.
chs: 头板的FW和板子不匹配，需要更换头板.
cht: 頭板的FW和板子不匹配，需要更換頭板.

# CoreBoard_Service_HEADVENDERDISMATHCH
source: Nozzle vender do not match.
chs: 喷头厂商不匹配.
cht: 噴頭廠商不匹配.

# CoreBoard_Err_NO_PAPER
source: The printer is out of paper.
chs: 打印机缺纸.
cht: 打印機缺紙.

# CoreBoard_Warning_EnterBakPrintMode
source: Has entered the offline print status
chs: 已进入离线打印状态.
cht: 已進入離線打印狀態.

# CoreBoard_Err_ILLEGAL_VOL
source: There is no valid voltage value.
chs: 存在不合法电压值.
cht: 存在不合法電壓值.

# CoreBoard_Err_EEPROM_LOCKED
source: EEPROM is locked.
chs: EEPROM已锁定.
cht: EEPROM已鎖定.

# CoreBoard_Fatal_DOUBLEY_ERRPOS
source: The position offset between two Y axis is too large.
chs: 双Y轴位置偏差过大.
cht: 雙Y軸位置偏差過大.

# CoreBoard_Warning_DOUBLEY_CORRECTOVERLIMIT
source: The number of correction double axis position is limited.
chs: 双轴位置偏差矫正次数超限.
cht: 雙軸位置偏差矯正次數超限.

# COMCommand_Abort_DoubleYERR
source: Emergency stop because of the position offset is too large.
chs: 双轴位置偏差过大，急停。
cht: 雙軸位置偏差過大,急停.

# COMCommand_Abort_InitERR
source: Failed to Initialize DSP.
chs: DSP初始化失败。
cht: DSP初始化失敗.

# COMCommand_Abort_NoPaperCancelPrint
source: The printer is out of paper.
chs: 打印机缺纸.
cht: 打印機缺紙.

# CoreBoard_Err_SAND_LAYING
source: Laying sand in process,please try again later.
chs: 正在进行铺沙，请稍后再试.
cht: 正在進行鋪沙，請稍後再試.

# CoreBoard_Err_CUR_ACTION_NOT_SUPPORT
source: The Printer's status don't support the current action.
chs: 打印机状态不支持当前所设动作.
cht: 印表機狀態不支援當前所設動作.

# CoreBoard_Err_LVDS_DISCONNECT
source: Head plate pump ink message timeout is not updated , probably LVDS disconnected.
chs: 头板泵墨消息超时未更新，很可能是LVDS已断开.
cht: 頭板泵墨消息超時未更新，很可能是LVDS已斷開.

# CoreBoard_Err_NOSUPPORT_DELAY
source: Head board version does not support time delay waveform, change the waveform or head board version.
chs: 头板版本不支持高低压延时的波形，请更换头板版本或者更改波形.
cht: 頭板版本不支持高低壓延時的波形，請更換頭板版本或者更改波形.

# CoreBoard_Warning_OLD_HB_BOOTLOADER
source: Because the head board bootloader too old , too slow resulting in the upgrade.
chs: 头板bootloader太老，导致升级过慢。
cht: 頭板bootloader太老，導致升級過慢。

# CoreBoard_Fatal_EXT_INIT_ERR
source: External device initialization is not complete.
chs: 外部设备初始化未完成。
cht: 外部設備初始化未完成。

# CoreBoard_Updating_UPDATE_ERROR
source: Upgrade error.
chs: 升级错误.
cht: 升級錯誤.

# CoreBoard_Updating_UPDATE_TIMEOUT
source: Upgrade timeout.
chs: 升级超时.
cht: 升級超時.

# CoreBoard_Warning_NO_PAPER
source: Printer is short of paper.
chs: 打印机缺纸.
cht: 打印機缺紙.

# CoreBoard_Warning_NO_MATERIAL
source: Printer is short of paper.
chs: 打印机缺纸.
cht: 打印機缺紙.

# CoreBoard_Err_NOT_SUPPORT_PRINT
source: Print function is not supported.
chs: 不支持打印功能.
cht: 不支持打印功能.

# CoreBoard_Err_EXTBOARD_UART_FAIL
source: The expansion board serial connection failed.
chs: 扩展板串口连接失败.
cht: 擴展板串口連接失敗.

# CoreBoard_Err_EXTBOARD_ERROR
source: Expansion board error.
chs: 扩展板错误.
cht: 擴展板錯誤.

# CoreBoard_Err_FPGA_UNDERFLOW
source: The FPGA buffer underflow.
chs: FPGA缓冲区下溢.
cht: FPGA緩衝區下溢.

# CoreBoard_Err_USB_TRANSFER
source: USB data transmission exception.
chs: USB数据传输异常.
cht: USB數據傳輸異常.

# CoreBoard_Err_FPGA_PROGRAM
source: FPGA logic error causes the program to run exception.
chs: FPGA逻辑错误导致程序运行异常.
cht: FPGA邏輯錯誤導致程序運行異常.

# EnumCADG_PrintError_BackDoorOpened
source: Back door opened
chs: 后门开
cht: 後門開

# EnumCADG_PrintError_FeedShaftJam
source: Feed Shaft jam
chs: 传送卡纸
cht: 傳送卡紙

# EnumCADG_PrintError_InkEmpty
source: Ink empty
chs: 无墨
cht: 無墨

# EnumCADG_PrintError_LeftDoorOpened
source: Left door opened
chs: 左侧门开
cht: 左側門開

# EnumCADG_PrintError_PaperKnifeJam
source: Paper knife jam
chs: 切刀卡纸
cht: 切刀卡紙

# EnumCADG_PrintError_PaperKnifeNotSet
source: Paper knife not set
chs: 切刀不在位
cht: 切刀不在位

# EnumCADG_PrintError_PaperLessA0
source: A0 PaperLess
chs: A0缺纸
cht: A0缺紙

# EnumCADG_PrintError_PaperLessA1
source: A1 PaperLess
chs: A1缺纸
cht: A1缺紙

# EnumCADG_PrintError_PaperLessA2
source: A2 PaperLess
chs: A2缺纸
cht: A2缺紙

# EnumCADG_PrintError_PaperLessA3
source: A3 PaperLess
chs: A3缺纸
cht: A3缺紙

# EnumCADG_PrintError_PrintShaftJam
source: Print shaft jam
chs: 打印卡纸
cht: 列印卡紙

# EnumCADG_PrintError_RightDoorOpened
source: Right door opened
chs: 右侧门开
cht: 右側門開

# EnumCADG_PrintError_ServerStatusError
source: Server Status Error
chs: 伺服器状态异常
cht: 伺服器狀態異常

# CoreBoard_Initialing_PANEL
source: Initializing the PLC
chs: 正在初始化PLC
cht: 正在初始化PLC

# Software_MediaHeightTooSmall
source: Due to the original point set and sheet height factors, partially off the print area of drawings!do you want to continue?
chs: 因原点设置及图幅高度因素,图档部分超出打印区域!是否继续?
cht: 因原點設置及圖幅高度因素,圖檔部分超出打印區域!是否繼續?
th: ความสูงของกระดาษเล็กเกินไป

# Software_MeybeLostLayer
source: There may be a lost layer. Do you reprint the upper layer?
chs: 可能存在丢层，是否重新打印上一层？
cht: 可能存在丟層，是否重新列印上一層？

# Software_ContinueAbort
source: Printing is not completed, whether to cancel the print?
chs: 打印未完成，是否取消打印？
cht: 列印未完成，是否取消列印？

# Software_OldMainBoard
source: Mainboard do not support temperature ratio function or ratio value errors.
chs: 主板不支持温度倍率功能或倍率错误.

# Software_MainBoardNoSupportSetKyVol
source: The mainboard does not support setting voltage.
chs: 主板不支持设置电压功能.
cht: 主板不支持溫度倍率功能或倍率錯誤.

# Software_ColorDeep
source: Color depth does not match
chs: 颜色深度不匹配
cht: 顏色深度不匹配

# Software_DataMiss
source: File data not read
chs: 未读取到文件数据
cht: 未讀取到文件數據

# Software_SwVersionQaNoTest
source: This version of software is not QA tested version!
chs: 此版本软件为未经QA测试的版本!
cht: 此版本軟件為未經QA測試的版本!

# CoreBoard_Service_BYHX_DATA
source: Service Call: 6.
th: เรียกช่างซ่อม :6.

# CoreBoard_Service_EEPROM_CHK
source: Service Call: 16.
th: เรียกช่างซ่อม : 16.
