Repository: 6555355/Scan_yan1
Catalog: ErrRes/ErrRes.*-*.resx
Languages: chs, cht, th

# COMCommand_Abort_Command
source: Invalid COM command
chs: 错误的 COM 命令
cht: 錯誤的 COM 命令
th: ทำให้คำสั่งสื่อสารเป็นโมฆะ

# COMCommand_Abort_Encoder
source: Encoder Error!
chs: 光栅出错！
cht: 光柵出錯!
th: เครื่องถอดรหัสบกพร่อง!

# COMCommand_Abort_FormatErr
source: COM data CRC error
chs: 串口通讯数据校验错误
cht: 串口通訊資料校驗錯誤
th: ข้อบกพร่อง crc ของข้อมูลคอมพิวเตอร์

# COMCommand_Abort_IndexNoMatch
source: Index error
chs: 索引错误
cht: 索引錯誤
th: ดัชนีบกพร่อง

# COMCommand_Abort_LimitSensor
source: Touch limit sensor
chs: 接触限位传感器
cht: 接觸限位感測器
th: เซนเซอร์จำกัดแบบสัมผัส

# COMCommand_Abort_SensorPause
source: Touch located sensor
chs: 接触定位传感器
cht: 接觸定位感測器
th: สถานที่ตั้งเซนเซอร์แบบสัมผัส

# COMCommand_Abort_MeasureSensor
source: Sensor error on measuring paper
chs: 测量纸宽传感器发生错误
cht: 測量紙寬感測器發生錯誤
th: เซนเซอร์วัดกระดาษบกพร่อง

# COMCommand_Abort_MoveAgain
source: Move again!
chs: 再次移动!
cht: 再次移動!
th: เคลื่อนที่อีกครั้ง!

# COMCommand_Abort_NoPaper
source: No paper
chs: 打印介質不存在
cht: 列印介質不存在
th: ไม่มีกระดาษ

# COMCommand_Abort_PaperJamX
source: PaperJam in Horizontal.
chs: 水平方向卡纸.
cht: 水準方向卡紙.
th: กระดาษติดในแนวระนาบ.

# COMCommand_Abort_PaperJamY
source: PaperJam in Vertical.
chs: 垂直方向卡纸.
cht: 垂直方向卡紙.
th: กระดาษติดในแนวดิ่ง.

# COMCommand_Abort_Parameter
source: Invalid COM parameter
chs: 错误的 COM 参数
cht: 錯誤的 COM 參數
th: ทำให้สภาพแวดล้อมสื่อสารเป็นโมฆะ

# COMCommand_Abort_TxTimeOut
source: COM send time out
chs: COM 发送超时
cht: COM 發送超時
th: หมดเวลาส่ง

# CoreBoard_Err_EP0OVERUN_SETUPDATA
source: EP0 port is break.
chs: EP0端口被中断.
cht: EP0埠被中斷.
th: พอร์ท ep0 แตกหัก.

# CoreBoard_Err_FPGA_LESSDATA
source: Print data is less than fire number
chs: 打印数据小于点火频率
cht: 列印資料小於點火頻率

# CoreBoard_Err_FPGA_ULTRADATA
source: Print data is more than fire number.
chs: 打印数据超出点火频率.
cht: 列印資料超出點火頻率.
th: ข้อมูลพิมพ์น้อยกว่าจำนวนไฟ.

# CoreBoard_Err_FPGA_WRONGSTATUS
source: Print data is not equal with fire number.
chs: 打印的数据和开火数不匹配.
cht: 列印的資料和開火數不匹配.
th: ข้อมูลพิมพ์ไม่เท่ากับจำนวนไฟ.

# CoreBoard_Err_INTERNAL_PRINTDATA
source: Print data mismatch with fire.
chs: 打印数据和点火频率不匹配.
cht: 列印資料和點火頻率不匹配.
th: ข้อมูลพิมพ์ไม่ตรงกับไฟ.

# CoreBoard_Err_UART2_TXTIMEOUT
source: Motion COM timeout.
chs: 运动COM超时.
cht: 運動COM超時.
th: เวลานอกการเคลื่อนที่การสื่อสาร.

# CoreBoard_Err_UART1_TXTIMEOUT
source: Head board COM timeout.
chs: 头板COM超时.
cht: 頭板COM超時.
th: เวลานอกการสื่อสารกับแผงหัวพิมพ์.

# CoreBoard_Err_USB1_USB1CONNECT
source: USB1.1 connect.
chs: USB1.1连接.
cht: USB1.1連接.
th: เชื่อมต่อ usb 1.1.

# CoreBoard_Fatal_INTERNAL_BANDDATASIZE
source: Band head BAND amount of data and the number does not match the actual BAND data.
chs: Band头中的Band数据数量和实际Band数据数量不符.
cht: Band頭中的Band數據數量和實際Band數據數量不符.
th: ข้อผิดพลาดภายใน 4.

# CoreBoard_Fatal_BYHX_DATA
source: Not Initialized by software.
chs: 板子出厂没有软件初始化.
cht: 板子出廠沒有軟體初始化.
th: ไม่ได้เตรียมความพร้อมโดยซอฟท์แวร์.

# CoreBoard_Fatal_INTERNAL_DMA0WORKING
source: DMA0 still working after a band complete.
chs: 一个band完成后DMA0仍在工作.
cht: 一個band完成後DMA0仍在工作.
th: ข้อผิดพลาดภายใน 6.

# CoreBoard_Fatal_DSPINITS1
source: Motion step 1.
chs: 运动step 1.
cht: 運動step 1.
th: เคลื่อนที่ขั้นที่ 1.

# CoreBoard_Fatal_DSPINITS2
source: Motion step 2.
chs: 运动step 2.
cht: 運動step 2.
th: เคลื่อนที่ขั้นที่ 2.

# CoreBoard_Fatal_DSPUPDATE_FAIL
source: DSP update fail.
chs: DSP升级失败.
cht: DSP升級失敗.
th: การปรับปรุง dsp ล้มเหลว.

# CoreBoard_Fatal_EEPROM_READ
source: EEPROM read failed.
chs: EEPROM读取失败.
cht: EEPROM讀取失敗.
th: การอ่าน eeprom ล้มเหลว.

# CoreBoard_Fatal_EEPROM_WRITE
source: EEPROM write failed.
chs: EEPROM书写失败.
cht: EEPROM書寫失敗.
th: การเขียนบน eeprom ล้มเหลว.

# CoreBoard_Fatal_FACTORY_DATA
source: Not initialized by factory.
chs: 板子出厂没有初始化.
cht: 板子出廠沒有初始化.
th: ไม่ได้เตรียมความพร้อมโปรแกรมโดยโรงงาน.

# CoreBoard_Fatal_HEADBOARD_RESET
source: Head board is reset.
chs: 头板复位.
cht: 頭板復位.
th: แผงบอร์ดหัวพิมพ์ถูกรีเซท.

# CoreBoard_Fatal_HEADINITS1
source: Head board step 1.
chs: 头板step1.
cht: 頭板step1.
th: แผงหัวพิมพ์ ขั้น 1.

# CoreBoard_Fatal_HEADINITS2
source: Head board step 2.
chs: 头板step2.
cht: 頭板step2.
th: แผงหัวพิมพ์ขั้น 2.

# CoreBoard_Fatal_HEADTOMAINROAD
source: LVDS error.
chs: LVDS错误.
cht: LVDS錯誤.
th: ข้อบกพร่อง lvds.

# CoreBoard_Fatal_INTERNAL_BANDDIRECTION
source: Band direction error value.
chs: Band方向超出定义.
cht: Band方向超出定義.
th: ค่าบกพร่องของแถบทิศทาง.

# CoreBoard_Fatal_INTERNAL_WRONGHEADER
source: Data header error.
chs: 数据头错误.
cht: 數據頭錯誤.
th: ข้อผิดพลาดภายใน 1.

# CoreBoard_Fatal_INTERNAL_WRONGHEADERSIZE
source: The data head size error.
chs: 数据头大小错误.
cht: 數據頭大小錯誤.
th: ข้อผิดพลาดภายใน 2.

# CoreBoard_Fatal_INTERNAL_JOBSTARTHEADER
source: Additional data should not be attached to the job head.
chs: 作业头中不应附带额外数据.
cht: 作業頭中不應附帶額外數據.
th: ข้อผิดพลาดภายใน 3.

# CoreBoard_Fatal_LIMITEDTIME_RUNOUT
source: Serious Error: Exceeds the time against the time-limit password, please input a new password.
chs: 严重错误: 超过限时时间，请输入新的密码.
cht: 嚴重錯誤: 超過限時時間，請輸入新的密碼.
th: ข้อบกพร่องร้ายแรง: เกินเวลารหัสแบบจำกัดเวลา โปรดป้อนรหัสใหม่.

# CoreBoard_Fatal_MANUFACTURERID_NOTMATCH
source: Board manufactory ID mismatch with FW. Please update FW.
chs: 板子的厂商ID不匹配,请升级固件.
cht: 板子的廠商ID不匹配,請升級固件.
th: idของบอร์ดไม่ตรงกับของบริษัท ฯ โปรดอัพเดท.

# CoreBoard_Fatal_INTERNAL_OLIMIT
source: Band print starting point is less than the origin.
chs: Band的打印起始点小于原点.
cht: Band的打印起始點小于原點.
th: ข้อผิดพลาดภายใน 8.

# CoreBoard_Fatal_INTERNAL_OPPLIMIT
source: Image too width.
chs: 图像超宽.
cht: 圖像超寬.
th: ข้อผิดพลาดภายใน 9.

# CoreBoard_Fatal_PRINTHEAD_NOTMATCH
source: Head board mismatch with factory data set. Please reset factory data or change a new head board.
chs: 头板与出厂数据不匹配,请重置出厂数据或者更换头板.
cht: 頭板與出廠資料不匹配,請重置出廠資料或者更換頭板.
th: แผงบอร์ดหัวพิมพ์ไม่ตรงกับข้อมูลที่ตั้งจากโรงงานโปรดรีเซทข้อมูลจากโรงงานหรือเปลี่ยนแผงหัวพิมพ์ใหม่.

# CoreBoard_Fatal_INTERNAL_PRINTPOINT
source: The print start position or end position error.
chs: 打印开始位置或结束位置错误.
cht: 打印開始位置或結束位置錯誤.
th: ข้อผิดพลาดภายใน 7.

# CoreBoard_Fatal_SPECTRAHVBINITS1
source: Spectra high voltage board can not be initialized in step 1.
chs: Spectra高压板无法在第1步初始化.
cht: Spectra高壓板無法在第1步初始化.
th: แผงแรงดันไฟฟ้าสูง spectra ไม่สามารถถูกเตรียมในขั้นที่ 1 ได้.

# CoreBoard_Fatal_SX2RESET
source: Usb chip illegal reset.
chs: Usb chip非法重启.
cht: Usb chip非法重啟.
th: การรีเซทชิพ usb อย่างผิดกฎหมาย.

# CoreBoard_Fatal_UILANGUAGE_NOT_MATCH
source: Serious Error: The language of the software setting does not correspond to authority. Please reset the software language or input the new language matching password again, and restart the printer.
chs: 严重错误: 软件使用的语言设置与权限不符，请重新设置软件语言或者输入新的语言选配密码, 并重启打印机.
cht: 嚴重錯誤: 軟體使用的語言設置與許可權不符，請重新設置軟體語言或者輸入新的語言選配密碼, 並重啟印表機.

# CoreBoard_Fatal_USB1_USB1CONNECT
source: USB1.1 connect.
chs: USB1.1连接.
cht: USB1.1連接.
th: เชื่อมต่อ usb 1.1.

# CoreBoard_Fatal_INTERNAL_WRONGFORMAT
source: Serial data format is wrong.
chs: 串口数据格式不对.
cht: 串口數據格式不對.
th: ข้อผิดพลาดภายใน 5.

# CoreBoard_Initialing_ARM
source: Initializing ARM.
chs: 正在初始化ARM.
cht: 正在初始化ARM.
th: การเขียนอักษรย่อ arm.

# CoreBoard_Initialing_DSP
source: Initializing DSP.
chs: 正在初始化DSP.
cht: 正在初始化DSP.
th: การเขียนอักษรย่อ dsp.

# CoreBoard_Initialing_FPGA
source: Initializing FPGA.
chs: 正在初始化FPGA.
cht: 正在初始化FPGA.
th: กำลังเขียนอักษรย่อ fpga.

# CoreBoard_Initialing_HEADBOARD
source: Initializing HEADBOARD.
chs: 正在初始化HEADBOARD.
cht: 正在初始化HEADBOARD.
th: การเตรียมแผงหัวพิมพ์.

# CoreBoard_Initialing_HVB
source: Initializing Spectra high voltage board.
chs: 安装 Spectra 高压板.
cht: 安裝 Spectra 高壓板.

# CoreBoard_Initialing_SX2
source: Initializing USB.
chs: 正在初始化USB.
cht: 正在初始化USB.
th: การเตรียม usb.

# CoreBoard_Service_FPGA0
source: Service Call: 1.
chs: Service Call: chip1.
cht: Service Call: chip1.
th: เรียกช่างซ่อม :1.

# CoreBoard_Service_FPGA1
source: Service Call: 2.
chs: Service Call: chip2.
cht: Service Call: chip2.
th: เรียกช่างซ่อม : 2.

# CoreBoard_Service_FPGA2
source: Service Call: 3.
chs: Service Call: chip3.
cht: Service Call: chip3.
th: เรียกช่างซ่อม :3.

# CoreBoard_Service_FPGA3
source: Service Call: 4.
chs: Service Call: chip4.
cht: Service Call: chip4.
th: เรียกช่างซ่อม :4.

# CoreBoard_Service_HEADTOMAINROAD
source: Service Call: 5.
chs: Service Call: chip5.
cht: Service Call: chip5.
th: เรียกช่างซ่อม :5.

# CoreBoard_Service_SX2
source: Service Call: 0.
chs: 在USB chip中服务错误.
cht: 在USB chip中服務錯誤.
th: เรียกช่างซ่อม :0.

# CoreBoard_Updating_DSP_BEGIN_TIMEOUT
source: DSP begin timeout.
chs: DSP开始升级命令超时.
cht: DSP開始升級命令超時.
th: เวลานอกการเริ่มต้น dsp.

# CoreBoard_Updating_CHECKSUM
source: Update checksum error.
chs: 升级校验码错误.
cht: 升級校驗碼錯誤.
th: ตรวจสอบข้อผิดพลาดอัพเกรด.

# CoreBoard_Updating_DSP_DATA_TIMEOUT
source: DSP data timeout.
chs: DSP数据超时.
cht: DSP數據超時.
th: เวลานอกข้อมูล dsp.

# CoreBoard_Updating_DSP_END_TIMEOUT
source: DSP end timeout.
chs: DSP结束超时.
cht: DSP結束超時.
th: เวลานอกการสิ้นสุด dsp.

# CoreBoard_Updating_FLASHOP
source: Flash error.
chs: Flash错误.
cht: Flash錯誤.
th: ข้อผิดพลาดที่หน่วยความจำแฟลช.

# CoreBoard_Updating_ILIGALFILE
source: Wrong updater file format.
chs: 错误的升级文件格式.
cht: 錯誤的升級檔格式.
th: รูปแบบแฟ้มข้อมูลที่ปรับปรุงผิดพลาด.

# CoreBoard_Updating_INTERNAL_DATA
source: Ilegal update data.
chs: 不合法的升级文件.
cht: 不合法的升級文件.
th: ข้อมูลถูกปรับปรุงอย่างผิดกฎหมาย.

# CoreBoard_Updating_UPDATE_SUCCESS
source: Update successfully.
chs: 升级成功.
cht: 升級成功.
th: การปรับปรุงสำเร็จ.

# CoreBoard_Updating_UPDATING
source: Updating.
chs: 正在更新.
cht: 正在更新.
th: กำลังอัพเกรด.

# CoreBoard_Warning_EP0OVERUN_REQUEST_IGNORE
source: EP0 overrun.
chs: EP0溢出.
cht: EP0溢出.
th: หยุดการทำงาน ep0.

# CoreBoard_Warning_LIMITEDTIME_FIRST
source: First warning: 100 hours left against current time-limit password, please request a new password from the producer.
chs: 第一次警告:再有100个小时就超出限时了, 请向厂家索取密码.
cht: 第一次警告:再有100個小時就超出限時了, 請向廠家索取密碼.

# CoreBoard_Warning_LIMITEDTIME_LAST
source: Last warning: After 1 hour, any printing will be stopped! Request a new password from the producer immediately!
chs: 最后一次警告: 再有1个小时就超出限时并停止打印, 请立即向厂家索取密码.
cht: 最後一次警告: 再有1個小時就超出限時並停止列印, 請立即向廠家索取密碼.
th: คำเตือนสุดท้าย : หลังจาก 1 ชั่วโมงแล้วการพิมพ์ใดๆจะหยุดลง ให้ร้องขอรหัสผ่านใหม่จากบริษัท เซ็นทรัลอินดัสตรี้ จำกัดทันที!

# CoreBoard_Warning_LIMITEDTIME_SECOND
source: Second warning: 50 hours left against current time-limit password, please request a new password from the producer.
chs: 第二次警告: 再有50个小时就超出限时了,请向厂家索取密码.
cht: 第二次警告: 再有50個小時就超出限時了,請向廠家索取密碼.

# CoreBoard_Warning_PUMP_BLACK
source: Pumping black.
chs: 黑色正在泵墨.
cht: 黑色正在泵墨.
th: การปั้มน้ำหมึกสีดำ.

# CoreBoard_Warning_PUMP_CYAN
source: Pumping cyan.
chs: 兰色正在泵墨.
cht: 蘭色正在泵墨.
th: การปั้มน้ำหมึกสีฟ้า.

# CoreBoard_Warning_PUMP_LIGHTCYAN
source: Pumping light cyan.
chs: 浅兰色正在泵墨.
cht: 淺蘭色正在泵墨.
th: การปั้มน้ำหมึกสีฟ้าอ่อน.

# CoreBoard_Warning_PUMP_LIGHTMAGENTA
source: Pumping light magenta.
chs: 浅品色正在泵墨.
cht: 淺品色正在泵墨.
th: การปั้มน้ำหมึกสีแดงอ่อน.

# CoreBoard_Warning_PUMP_MAGENTA
source: Pumping magenta.
chs: 品色正在泵墨.
cht: 品色正在泵墨.
th: การปั้มน้ำหมึกสีแดง.

# CoreBoard_Warning_PUMP_YELLOW
source: Pumping yellow.
chs: 黄色正在泵墨.
cht: 黃色正在泵墨.
th: การปั้มน้ำหมึกสีเหลือง.

# CoreBoard_Warning_TIME_PASSWORD_BOARDIDNOTMATCH
source: Time-limit password and board ID mismatch. The password is ignored, please input again.
chs: 限时密码和板子不匹配; 本次输入密码无效, 请重新输入密码.
cht: 限時密碼和板子不匹配; 本次輸入密碼無效, 請重新輸入密碼.
th: รหัสผ่านแบบจำกัดเวลาและเลขประจำตัวโรงงานผลิตไม่ตรงกัน รหัสผ่านถูกล้มเลิก โปรดป้อนใหม่อีกครั้งหนึ่ง.

# CoreBoard_Warning_TIME_PASSWORD_MANUFACTURERIDNOTMATCH
source: Time-limit password and manufacturer ID mismatch. The password is ignored, please input again.
chs: 限时密码和厂商不匹配; 本次输入密码无效, 请重新输入密码.
cht: 限時密碼和廠商不匹配; 本次輸入密碼無效, 請重新輸入密碼.

# CoreBoard_Warning_TIME_PASSWORD_WRONG
source: Illegal time-limit password. The password is ignored, please input again.
chs: 不是一个合法限时密码; 本次输入密码无效, 请重新输入密码.
cht: 不是一個合法限時密碼; 本次輸入密碼無效, 請重新輸入密碼.

# CoreBoard_Warning_TIME_PASSWORD_WRONGINPUT
source: Time-limit password input mistake, contains the forbidden character. The password is ignored, please input again.
chs: 输入限时密码错误，含有含有非法字符; 本次输入密码无效, 请重新输入密码.
cht: 輸入限時密碼錯誤,含有含有非法字元; 本次輸入密碼無效, 請重新輸入密碼.
th: ป้อนรหัสผ่านแบบจำกัดเวลาผิดพลาด มีพยัญชนะต้องห้ามอยู่ด้วย รหัสผ่านถูกล้มเลิก โปรดป้อนใหม่อีกครั้งหนึ่ง.

# CoreBoard_Warning_UNKNOWNHEADERTYPE
source: unkown warning
chs: 不知道的警告
cht: 不知道的警告
th: การเตือนที่ไม่มีใครทราบ

# EnumCmdSrc_FPGA_Abort_GREATERTHANBANDHEADER
source: the actual print data is greater than the data in Band header.
chs: 实际打印数据大于band头中打印数据个数
cht: 實際列印資料大於band頭中列印資料個數

# EnumCmdSrc_FPGA_Abort_HEADERTYPE
source: Header type is not 0,1,2
chs: header type 不是0,1,2
cht: header type 不是0,1,2
th: ชนิดส่วนหัวไม่ใช่ 0,1,2

# EnumCmdSrc_FPGA_Abort_JOBHEADERMARKED
source: Read band, job header marked the first confusion
chs: 读取band,job头时置标志混乱,不是job头,job尾也不是band头
cht: 讀取band,job頭時置標誌混亂,不是job頭,job尾也不是band頭
th: อ่านแถบสี ส่วนหัวของงานทำให้ความสับสนแรกปรากฏเป็นรอย

# EnumCmdSrc_FPGA_Abort_LESSTHANBANDHEADER
source: the actual print data is less than the data in Band header.
chs: 实际打印数据小于band头中打印数据个数
cht: 實際列印資料小於band頭中列印資料個數
th: ข้อมูลการพิมพ์จริงน้อยกว่าข้อมูลในแถบส่วนหัว.

# EnumCmdSrc_FPGA_Abort_NOFINDBYHX
source: can not find Data header
chs: 找不到数据帧头
cht: 找不到數據幀頭
th: ไม่สามารถค้นพบข้อมูลส่วนหัว

# EnumCmdSrc_FPGA_Abort_NOTENOUGHFIRE
source: Not enough Fire on the number of orders received by the end of print
chs: 点火个数不够就收到结束打印命令
cht: 點火個數不夠就收到結束列印命令
th: มีไฟไม่พอบนจำนวนของคำสั่งที่ได้รับตอนจบงานพิมพ์

# EnumCmdSrc_FPGA_Abort_STILLFIREAFTERPRINT
source: Fire is still to come after the completion of the band print.
chs: band打印完后仍然来点火
cht: band列印完後仍然來點火
th: band ไฟยังคงเข้ามาหลังพิมพ์แถบเสร็จสมบูรณ์แล้ว.

# EnumCmdSrc_FPGA_Abort_FIBERNOTCONNECTED
source: Internal 10.
chs: 内部错误 10。
cht: 內部錯誤 10。
th: ข้อผิดพลาดภายใน 10.

# EnumCmdSrc_FX2_Service_MAINBOARDSERIOUSERROR
source: MainBoard Serious Error: Factory data is not set or set incorrectly
chs: 主板严重错误: 出厂数据没有设置或者设置错误
cht: 主板嚴重錯誤: 出廠資料沒有設置或者設置錯誤
th: แผงวงจรหลักบกพร่องร้ายแรง : ข้อมูลโรงงานไม่ได้ตั้งค่ามาหรือตั้งค่าไม่ถูกต้อง

# EnumCmdSrc_FX2_Service_EEPROM_READ
source: MainBoard Service Call: EEPROM read failure
chs: 主板Service Call: 读取EEPROM失败
cht: 主板Service Call: 讀取EEPROM失敗
th: เรียกซ่อมแผงวงจรหลัก: การอ่าน eeprom ล้มเหลว

# EnumCmdSrc_FX2_Service_EEPROM_WRITE
source: MainBoard Service Call: EEPROM write failure
chs: 主板Service Call: 写入EEPROM失败
cht: 主板Service Call: 寫入EEPROM失敗
th: เรียกซ่อมแผงวงจรหลัก: การเขียนบน eeprom ล้มเหลว

# EnumCmdSrc_FX2_Service_I2CREADFPGA_ERROR
source: MainBoard Internal error: I2C write FPGA error
chs: 主板内部错误: I2C写FPGA错误
cht: 主板內部錯誤: I2C寫FPGA錯誤
th: ข้อบกพร่องภายในแผงวงจรหลัก : i2c เขียน ข้อบกพร่อง fpga

# EnumCmdSrc_FX2_Service_I2CWRITEFPGA_ERROR
source: MainBoard Internal error: I2C write FPGA error
chs: 主板内部错误: I2C写FPGA错误
cht: 主板內部錯誤: I2C寫FPGA錯誤
th: ข้อบกพร่องภายในแผงวงจรหลัก : i2c เขียน ข้อบกพร่อง fpga

# EnumCmdSrc_FX2_Warning_BASEVNOSET
source: MainBoard Warning: Base Voltage is not set, use the default values
chs: 主板警告: 基准电压没有设置, 使用缺省值
cht: 主板警告: 基準電壓沒有設置, 使用缺省值
th: คำเตือนแผงวงจรหลัก : แรงดันไฟฟ้าฐานไม่ได้ตั้งเอาไว้, ใช้ค่าที่ตั้งเอาไว้ก่อน

# EnumCmdSrc_FX2_Warning_CALIBRATIONVNOSET
source: MainBoard Warning: Adjust voltage is not set, use the default values
chs: 主板警告: 矫正电压没有设置, 使用缺省值
cht: 主板警告: 矯正電壓沒有設置, 使用缺省值
th: คำเตือนแผงวงจรหลัก : การปรับค่าแรงดันไฟฟ้าไม่ได้ตั้งเอาไว้, ใช้ค่าที่ตั้งเอาไว้ก่อน

# EnumCmdSrc_FX2_Warning_SPRAYPARAMETERSNOSET
source: MainBoard Warning: Spray Parameter is not set, use the default values
chs: 主板警告: 闪喷参数没有设置, 使用缺省值
cht: 主板警告: 閃噴參數沒有設置, 使用缺省值
th: คำเตือนแผงวงจรหลัก : สภาพแวดล้อมการพ่นไม่ได้ตั้ง, ใช้ค่าที่ตั้งเอาไว้ก่อน

# EnumCmdSrc_FX2_Warning_USERSETTINGNOSET
source: MainBoard Warning: User data (the type of ink, jet speed is not set, use the default values
chs: 主板警告: 用户数据(墨水类型, 喷射速度)没有设置, 使用缺省值
cht: 主板警告: 用戶資料(墨水類型, 噴射速度沒有設置, 使用缺省值
th: คำเตือนแผงวงจรหลัก : ข้อมูลผู้ใช้(ชนิดของน้ำหมึก, อัตราเร็วแบบไอพ่นไม่ได้ตั้งไว้, ใช้ค่าที่ตั้งเอาไว้ก่อน)

# EnumCmdSrc_HEADBOARD_HEADBOARDFEATURESDATANOMATCH
source: HeadBoard Serious Error: HeadBoard data and user settings do not match
chs: 头板严重错误: 头板特性数据与用户设置不符
cht: 頭板嚴重錯誤: 頭板特性資料與用戶設置不符
th: แผงหัวพิมพ์บกพร่องอย่างร้ายแรง : ข้อมูลแผงหัวพิมพ์และที่ผู้ใช้ตั้งค่าไม่ตรงกัน

# EnumCmdSrc_HEADBOARD_NOHEADBOARDFEATURESDATA
source: HeadBoard Serious Error: HeadBoard data did not write or format errors
chs: 头板严重错误: 头板特性数据没有写入或者格式错误
cht: 頭板嚴重錯誤: 頭板特性資料沒有寫入或者格式錯誤
th: แผงหัวพิมพ์บกพร่องร้ายแรง : ข้อมูลแผงหัวพิมพ์ไม่ถูกเขียนหรือจัดรูปแบบบกพร่อง

# EnumCmdSrc_HEADBOARD_EEPROM_READ
source: HeadBoardService Call: EEPROM read failure
chs: 头板Service Call: 读取EEPROM失败
cht: 頭板Service Call: 讀取EEPROM失敗
th: เรียกช่างซ่อมแผงหัวพิมพ์ : การอ่าน eeprom ล้มเหลว

# EnumCmdSrc_HEADBOARD_EEPROM_WRITE
source: HeadBoard Service Call: EEPROM write failure
chs: 头板Service Call: 写入EEPROM失败
cht: 頭板Service Call: 寫入EEPROM失敗
th: service call: เรียกช่างซ่อมแผงหัวพิมพ์ : การเขียน eeprom ล้มเหลว

# Software_BoardCommunication
source: USB communication error
chs: USB 通讯错误
cht: USB 通訊錯誤
th: การสื่อสารของ usb บกพร่อง

# Software_FileColorNumber
source: Prt color number mismatch with printer!
chs: 打印文件颜色数与打印机不匹配!
cht: 列印檔顏色數與印表機不匹配!
th: หมายเลขสีที่พิมพ์ไม่ตรงกับเครื่องพิมพ์!

# Software_FileNoSupportForamt
source: Not support file format!
chs: 不支持的文件格式!
cht: 不支援的檔格式!
th: ไม่รองรับรูปแบบแฟ้มข้อมูล!

# Software_FileNoSupportResolution
source: Not support resolution in prt!
chs: 打印文件里包含不支持的分辨率!
cht: 列印檔裏包含不支援的解析度!
th: ไม่รองรับความละเอียดในการพิมพ์!

# Software_FilePassMatchResolution
source: Can't print this job with current pass setting. Press ok to print this job with {0} pass.
chs: 使用当前的pass设定不能打印当前作业,请点击确定用{0}pass打印该作业.
cht: 使用當前的pass設定不能列印當前作業,請點擊確定用{0}pass列印該作業.
th: ไม่สามารถพิมพ์งานนี้ด้วยการตั้งค่าพาส(จำนวนซ้ำ)ปัจจุบัน กด ok เพื่อพิมพ์งานนี้ด้วย {0} พาส.

# Software_FileResolutionNoMatchPrinter
source: Prt resolution mismatch with printer resolution!
chs: 打印文件的分辨率和打印机分辨率不匹配!
cht: 列印檔的解析度和印表機解析度不匹配!
th: ความละเอียดที่พิมพ์ไม่ตรงกับความละเอียดเครื่องพิมพ์!

# Software_Language
source: Language not support
chs: 不支持的语言
cht: 不支援的語言
th: ไม่รองรับภาษา

# Software_MediaTooSmall
source: Paper width too small.
chs: 介质太小.
cht: 介質太小.
th: ความกว้างกระดาษน้อยเกินไป.

# Software_MediaWidthTooSmall
source: Due to the original point set and sheet width factors, partially off the print area of drawings! (Printable width {0} only), do you want to continue?
chs: 因原点设置及图幅宽度因素,图档部分超出打印区域!(仅可打印{0}宽度),是否继续?
cht: 因原點設置及圖幅寬度因素,圖檔部分超出打印區域!(僅可打印{0}寬度),是否繼續?
th: ความกว้างกระดาษน้อยเกินไป.

# Software_MismatchID
source: Printer id not supported! Please upgrade software!
chs: 不支持的打印机! 请升级软件!
cht: 不支援的印表機! 請升級軟體!
th: หมายเลขประจำตัวเครื่องพิมพ์ไม่ได้รับการรับรอง โปรดปรับปรุงซอฟท์แวร์ให้ทันสมัย!

# Software_NoDevice
source: Can not open USB device
chs: 打开 USB 时出错
cht: 打開 USB 時出錯
th: ไม่สามารถเปิดอุปกรณ์ usb ได้

# Software_Parser
source: Invalid file format
chs: 错误的打印文件格式
cht: 錯誤的列印檔格式
th: รูปแบบแฟ้มข้อมูลเป็นโมฆะ

# Software_PrintMode
source: Print parameter error
chs: 打印模式参数错
cht: 列印模式參數錯
th: สภาพแวดล้อมการพิมพ์บกพร่อง

# Software_Shakhand
source: Shakehand error between software and FW
chs: 软件和打印机握手失败
cht: 軟體和印表機握手失敗
th: ข้อบกพร่องความร่วมมือระหว่างซอฟท์แวร์และ fw

# Software_StepTolTooMuch
source: Y lost feedback,or step not calibration!
chs: Y向反馈丢失,或者是步进没有校准!
cht: Y向回饋丟失,或著是步進沒有校準!
th: ไม่มีการป้อนกลับในทิศทาง y หรือไม่ได้คำนวณขั้น!

# Software_VersionNoMatch
source: The current Version is {0}, please upgrade to version{1}
chs: 固件当前版本是{0}，请更新到{1}
cht: 固件當前版本是{0}，請更新到{1}
th: รุ่นปัจจุบัน คือ {0} โปรดปรับปรุงให้ทันสมัยเป็นรุ่น {1}

# COMCommand_Abort_StepEncoder
source: No found stepping encoder!
chs: 没有发现步进编码器！
cht: 沒有發現步進編碼器！
th: ไม่พบขั้นตอนการเข้ารหัส!

# Software_GetHWSettingFail
source: Get HW setting failed!
chs: 获取硬件设定失败!
cht: 獲取硬體設定失敗!
th: ได้การตั้งค่า hw ล้มเหลลว!

# Software_MustUpdateFW
source: Must update new FW.
chs: 必须升级固件.
cht: 必须升级固件.

# Software_FWIsNotDogKey
source: Wrong updater file format.Not Encrypt.
chs: 不合法的升级文件.没有加密.
cht: 不合法的升级文件.没有加密.

# Software_UpdateFileWrongFormat
source: Wrong updater file format.
chs: 错误的升级文件格式.
cht: 错误的升级文件格式.

# COMCommand_Abort_ReadEEPROM
source: Read EEPROM error.
chs: 读 EEPROM 错误.
cht: 讀 EEPROM 錯誤.
th: อ่าน eeprom บกพร่อง.

# COMCommand_Abort_WriteEEPROM
source: Write EEPROM error!
chs: 写 EEPROM 错误!
cht: 寫 EEPROM 錯誤!
th: การเขียน eeprom บกพร่อง!

# COMCommand_Abort_WriteEEPROMTwice
source: Write EEPROM 2 times, the general report this error, the Main board did not respond to signals!
chs: 写EEPROM 2 次，一般报告这个错误时，主板没有应答信号!
cht: 寫EEPROM 2次，一般報告這個錯誤時，主板沒有應答信號!
th: เขียน eeprom 2 ครั้ง โดยทั่วไปแล้วมีการรายงานข้อบกพร่องนี้ แผงวงจรหลักไม่ตอบสนองต่อสัญญาณ!

# COMCommand_Abort_TimeOver
source: The time limit should run out of!
chs: 限制的时间已经用光了!
cht: 限制的時間已經用光了!
th: การจำกัดเวลาจะต้องใช้จนหมด!

# COMCommand_Abort_TimeWarning
source: To limit the time with less than 50 hours!
chs: 到限制的时间还有不足50个小时!
cht: 到限制的時間還有不足50個小時!
th: เพื่อจำกัดเวลาไม่ให้เกิน 50 ชั่วโมง!

# COMCommand_Abort_Lang
source: Language and restrictions do not match!
chs: 语言和限制的不匹配!
cht: 語言和限制的不匹配!
th: ภาษาและข้อจำกัดไม่ตรงกัน!

# COMCommand_Abort_IllegalContent
source: The contents of EEPROM error, EEPROM configuration did not complete!
chs: 错误的EEPROM 的内容，EEPROM 配置没有完成!
cht: 錯誤的EEPROM 的內容，EEPROM 配置沒有完成!
th: เนื้อหาของ eeprom บกพร่อง ค่าที่ใช้กำหนดการทำงานของ eeprom ไม่สมบูรณ์!

# COMCommand_Abort_IllegalPwd
source: Wrong password!
chs: 错误的密码!
cht: 錯誤的密碼!
th: รหัสผ่านผิดพลาด!

# COMCommand_Abort_NotifyMeasure
source: Do you want to measure media?
chs: 是否测量介质?
cht: 是否測量介質?

# COMCommand_Abort_NotifyGoHome
source: Do you want to Back to the origin?
chs: 是否回原点?
cht: 是否回原點?

# COMCommand_Abort_SwDogEey
source: Software has not dongle!
chs: 软件没有使用加密狗!
cht: 软件没有使用加密狗!

# CoreBoard_Updating_EREASE
source: The ARM flash erases.
chs: ARM 闪存擦除.
cht: ARM 快閃記憶體擦除.
th: แขนสว่างวูบถูกลบทิ้ง.

# CoreBoard_Updating_FX2NOEEPROM
source: EEPROM unusable.
chs: EEPROM 不可用.
cht: EEPROM 不可用.
th: ไม่สามารถใช้ eeprom ได้.

# CoreBoard_Updating_FX2UPDATELOADER
source: Update loader failed !
chs: 加载升级文件失败！
cht: 載入升級檔失敗！
th: ปรับปรุงเครื่องอ่านข้อมูลล้มเหลว!

# CoreBoard_Warning_OPTION_PASSWORD_WRONGINPUT
source: Inputed Optional password mistake, containing the value of 0 ~ F outside.
chs: 输入选配密码错误，含有非0~F的值.
cht: 輸入選配密碼錯誤，含有非0~F的值.
th: ป้อนรหัสผ่านเสริมผิดพลาด, โดยมีค่า 0 ~ นอก f.

# CoreBoard_Warning_OPTION_PASSWORD_WRONG
source: Not a legitimate Optional password.
chs: 不是一个合法选配密码.
cht: 不是一個合法選配密碼.
th: ไม่ใช่รหัสผ่านเสริมที่ถูกต้องตามกฎหมาย.

# CoreBoard_Warning_OPTION_PASSWORD_MANUFACTURERIDNOTMATCH
source: Optional password and vendors do not match.
chs: 选配密码和厂商不匹配.
cht: 選配密碼和廠商不匹配.
th: รหัสผ่านเสริมและผู้จำหน่ายสินค้าไม่ตรงกัน.

# CoreBoard_Warning_OPTION_PASSWORD_BOARDIDNOTMATCH
source: Optional password and the board did not match.
chs: 选配密码和板子不匹配.
cht: 選配密碼和板子不匹配.
th: รหัสผ่านเสริมและแผงวงจรไม่ตรงกัน.

# CoreBoard_Warning_PUMP_PROHIBIT_SENSOR
source: Ink safe tank is full, all ink pumps are stopped.
chs: 泵墨安全瓶满了, 所有墨泵停止供墨.
cht: 泵墨安全瓶滿了, 所有墨泵停止供墨.
th: เพื่อความปลอดภัย, เมื่อถังน้ำหมึกเต็มปั้มน้ำหมึกทั้งหมดหยุดทำงาน.

# CoreBoard_Warning_OVER_SPEED_NOT_SUPPORT
source: The head board don't support over speed, system is forced to use high speed.
chs: 试图在不支持超频的头板版本上使用超频, 系统强制使用高速打印.
cht: 試圖在不支援超頻的頭板版本上使用超頻, 系統強制使用高速列印.
th: แผงหัวพิมพ์ไม่สนับสนุนอัตราเร็วเกินไป ระบบจะบีบบังคัยให้ใช้อัตราเร็วสูง.

# CoreBoard_Err_UV_CTR_WRONGSTATUS
source: Internal Status.
chs: 内部状态.
cht: 內部狀態.
th: สถานะภายใน.

# CoreBoard_Err_FPGA_WRONGCOMMAND
source: The FPGA received wrong command.
chs: FPGA 收到错误的命令.
cht: FPGA 收到錯誤的命令.
th: Fpga ได้รับคำสั่งผิด.

# CoreBoard_Err_MOTION_SPEED_BAD
source: Movement speed too fast or uneven, data output unfinished received ignition command.
chs: 运动速度太快或不均匀，数据输出未完成就收到点火命令.
cht: 運動速度太快或不均勻，資料輸出未完成就收到點火命令.
th: อัตราเร็วการเคลื่อนที่สูงเกินไปหรือไม่เสมอกัน, การปล่อยข้อมูลออกมายังไม่เสร็จเมื่อได้รับคำสั่งจุดระเบิด.
